{
  "backend/main.mo": "Motoko canister defining game state, dialogue nodes, activities, memorable moments, and save data with methods to start or continue a game.",
  "feature_evidence.json": "Metadata listing implemented features, related files, components, and test IDs for replica error handling and retry logic.",
  "frontend-file-summaries.txt": "Lookup table summarizing major frontend files and their roles in UI, gameplay, scenes, and systems.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and base styling.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling navigation, startup logic, backend launch handling with error normalization, and retry flow.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of activities that affect trust and may unlock moments.",
  "frontend/src/game/audio/useAudio.ts": "Implements a Zustand-based audio manager with volume, mute control, and background music playback.",
  "frontend/src/game/characters/Puro.tsx": "Renders a 3D Puro character with idle animation and interaction handling for dialogue triggering.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Provides touch-based joystick and look controls for mobile devices, updating player movement and camera look.",
  "frontend/src/game/controls/usePlayerControls.ts": "Tracks keyboard, joystick, and look input to compute movement vectors and look deltas for the player.",
  "frontend/src/game/customization/customizationData.ts": "Contains definitions and metadata for placeable customization items and their allowed locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines dialogue nodes and branching choices with trust effects and optional requirements for Puro's conversations.",
  "frontend/src/game/GameView.tsx": "In‑game view mounting the 3D canvas, initializing game state, managing overlays, and handling mount success or errors.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates contextual letter responses based on keyword detection from predefined friendly, curious, and encouraging sets.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a book-sorting minigame that adjusts trust based on correct categorization and signals completion.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A drawing-viewing mini-game where players cycle through Puro’s drawings, gaining trust for viewing all images.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide-and-seek guessing mini-game where finding Puro affects trust and ends when he’s found or time runs out.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "A launcher component that displays a menu and loads selected mini-games like book sorting, drawing, or hide-and-seek.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a selected moment’s title and scene content in a modal-like card with a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines the Moment interface and provides a list of moments with titles, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library scene with player movement, lighting, objects, and Puro, updating camera and player position each frame.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store managing trust, progress, UI visibility, unlocks, letters, and customization data with persistent state.",
  "frontend/src/game/story/endings.ts": "Defines ending structures and a list of endings based on trust thresholds, plus a helper to select the matching ending.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the game’s ending based on trust level, shows final scene and options to start a new game or return to title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Renders an activity selection menu that adjusts trust, completes activities, and may unlock moments.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Displays discovered and placed customization items and allows placing new items in the library.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Shows dialogue nodes with selectable choices that modify trust and navigate the dialogue tree.",
  "frontend/src/game/ui/LettersPanel.tsx": "Allows writing letters and viewing responses, enforcing length limits and generating delayed replies.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Lists unlockable moments and lets the player view unlocked ones via a moment player.",
  "frontend/src/game/ui/PauseMenu.tsx": "Provides pause options including resume, quick-access menus, settings, and progress reset.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Offers audio controls such as mute and volume adjustment with a back navigation option.",
  "frontend/src/game/ui/TrustMeter.tsx": "Displays the player's trust level with a color-coded label and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching game state and performing game-related backend mutations.",
  "frontend/src/index.css": "Defines global Tailwind styles and custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/startup.ts": "Handles one‑time app startup tasks like asset preloading and storage checks with idempotent control.",
  "frontend/src/ui/CreditsScreen.tsx": "Renders the game's credits screen with description, features, and a link back to the title screen.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays user‑friendly and detailed error diagnostics when game launch fails, with retry and back options.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches game runtime errors, shows a styled error card with optional stack details, and lets the user return to the title screen.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the game’s title menu with background, logo, and buttons for new game, continue, settings, and credits, handling loading/disabled states.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch-related errors into user-friendly messages and categories for new-game or continue actions.",
  "frontend/STARTUP.md": "Documentation describing the app’s startup initialization flow, responsibilities, and extension guidelines.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the game’s concept, architecture notes, known issues, and implemented features for state tracking."
}