{
  "backend/main.mo": "Motoko backend defining dialogue, activities, moments, letters, and per‑player game state with functions to start or continue a game.",
  "feature_evidence.json": "Feature evidence list mapping collision‑trigger features to involved frontend files and components with test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their roles in UI, 3D scene, controls, state, and minigames.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed Internet Computer deployments.",
  "frontend/index.css": "Tailwind base styles and theme variables for light/dark modes with color tokens.",
  "frontend/index.html": "HTML entry point wiring the root div and bootstrapping the React app.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational notes on keeping the canister running and handling server‑offline issues.",
  "frontend/src/App.tsx": "Main React app controller handling startup, backend availability, screen routing, game launch logic, and diagnostics tracking.",
  "frontend/src/config/adminGate.ts": "Local‑only admin gate config defining a username and derived storage key for admin unlock state.",
  "frontend/src/game/activities/activities.ts": "Defines activity data with trust effects and optional unlocks for moments.",
  "frontend/src/game/audio/useAudio.ts": "Manages global audio settings and playback using Zustand, including volume, mute state, and background music control.",
  "frontend/src/game/characters/Puro.tsx": "React Three Fiber component for Puro with idle animation, hover effects, and click-triggered dialogue.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Touch control overlay providing joystick, look controls, and jump handling for mobile devices.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard and joystick inputs into movement and look data while respecting pause and terminal states.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store holding raw control inputs like joystick, look delta, and jump requests.",
  "frontend/src/game/customization/customizationData.ts": "Static data describing customizable items and their possible placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines a branching dialogue tree with nodes, choices, trust effects, and optional trust requirements.",
  "frontend/src/game/GameView.tsx": "Main game view that initializes state, mounts the 3D scene, manages HUD and UI panels, and handles pause and audio setup.",
  "frontend/src/game/letters/letterTemplates.ts": "Provides categorized response templates and generates a reply based on keywords in a letter.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a drag-and-drop book‑sorting game that adjusts trust and detects completion.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Displays a gallery of Puro's drawings where viewing each increases trust.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "Runs a timed hide‑and‑seek guessing game with trust rewards and penalties.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Provides a menu to launch different mini‑games and manages their lifecycle.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Shows a selected narrative moment with scene text and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data entries with titles, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library scene with player movement, jump physics, camera control, and Puro proximity detection.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store defining game and UI state plus actions for trust, activities, dialogue, letters, endings, and customization, persisted locally.",
  "frontend/src/game/story/endings.ts": "Defines ending data and a helper that returns the correct ending based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "React component that displays the final ending based on trust level and allows starting a new game or returning to the title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Menu for performing activities that modify trust, mark completion, unlock moments, and close the panel.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "UI for placing discovered customization items in the library and viewing already placed items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Dialogue system panel showing dialogue text, trust‑based choices, and navigation through dialogue nodes.",
  "frontend/src/game/ui/LettersPanel.tsx": "Panel for writing letters, sending them, and viewing auto‑generated responses in an inbox.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of unlockable moments and allows playing unlocked ones via MomentPlayer.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause menu providing resume, quick-access navigation, settings, terminal (if unlocked), and reset options.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Settings UI for adjusting audio volume, toggling mute, and returning to the previous screen.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows current trust level with color-coded label and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health using an actor and exposes status, errors, timestamps, and refetch control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, status tracking, and AuthClient initialization.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for synced backend gameplay actions like fetching game state, making choices, and updating progress.",
  "frontend/src/index.css": "Defines Tailwind layers and a warm color palette with light and dark themes plus base typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/startup.ts": "Handles one‑time startup tasks including storage checks and asset preloading.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store providing a simple local username gate to unlock admin mode.",
  "frontend/src/state/useServerAccessStore.ts": "Empty placeholder file for a future server access store.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for entering a local admin username to unlock or lock admin mode.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays the game's credits, features, and a back button over a themed background.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin‑only in‑app terminal overlay supporting command execution and live output.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Shows user‑friendly and detailed error info when game launch fails, with retry and back options.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches game runtime errors and displays a UI with optional stack details and a back-to-title button.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Shows a small status badge indicating backend health with colored text and icon.",
  "frontend/src/ui/terminal/commands.ts": "Implements a simple terminal command parser handling help, clear, diagnostics, and server status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into readable text lines for terminal display.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility, input/output lines, and state updates.",
  "frontend/src/ui/TitleScreen.tsx": "Main title screen UI with game start options, admin tools, server status display, and offline notices.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes launch-related errors into categorized user-friendly summaries with preserved raw messages.",
  "frontend/STARTUP.md": "Documentation explaining the startup sequence, responsibilities of startup.ts, and how App.tsx invokes it.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Tracks versioned project state, architectural notes, and known issues for a 3D visual-novel hybrid game dependent on an Internet Computer backend. Highlights gameplay structure, admin-control constraints, backend availability requirements, and multiple unresolved technical conflicts/errors."
}