{
  "backend/main.mo": "Motoko canister defining game state, dialogue nodes, activities, moments, letters, and save data with functions to start and continue games.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing pre-written summaries of many frontend source files for reference.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed Internet Computer deployments.",
  "frontend/index.css": "Tailwind CSS setup with theme variables, dark mode values, and base styling rules.",
  "frontend/index.html": "HTML entrypoint loading the React app via main.tsx.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational instructions for maintaining canister availability and addressing offline errors.",
  "frontend/src/App.tsx": "Main React component controlling startup, navigation, backend checks, and game launch handling with diagnostics.",
  "frontend/src/config/adminGate.ts": "Config for simple username-based admin access and its associated storage key.",
  "frontend/src/game/activities/activities.ts": "Defines activity types and a list of in-game activities with trust effects and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Zustand-based audio manager that handles volume, mute state, and background music playback.",
  "frontend/src/game/characters/Puro.tsx": "React Three Fiber component rendering Puro with idle animation and click/hover interactions to trigger dialogue.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Mobile touch control overlay providing joystick movement, look controls, and jump handling, disabled when paused or terminal open.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard, joystick, and look inputs into movement and look vectors while respecting pause and terminal states.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store managing joystick values, look deltas, one-shot jump requests, and control resets.",
  "frontend/src/game/customization/customizationData.ts": "Lists customization items with descriptions and allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines dialogue nodes and branching choices with trust effects and optional requirements for the game's conversation system.",
  "frontend/src/game/GameView.tsx": "Main game container that initializes state, mounts the 3D canvas, plays music, and displays UI panels and overlays based on game state.",
  "frontend/src/game/letters/letterTemplates.ts": "Contains preset response arrays and a function that returns a contextual reply based on keywords in a letter.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a drag-and-sort style book categorization game that adjusts trust based on accuracy and completion.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Provides a gallery-like viewer for Puro’s drawings, increasing trust as the player views all items.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "Implements a timed hide‑and‑seek guessing game with trust rewards or penalties depending on performance.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Launches mini‑games from a menu and handles switching and closing logic.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with title, scene text, and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data entries with titles, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/HiveScene.tsx": "Renders a 3D hive area with player movement, jumping physics, and procedural tree placement.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library scene, handling player movement, jumping, camera controls, texture loading, and proximity-based teleport triggers with Puro.",
  "frontend/src/game/state/useGameStore.ts": "Defines the global game store with persistent state for trust, progress, scenes, UI panels, and actions to update gameplay variables.",
  "frontend/src/game/story/endings.ts": "Defines ending data and provides a helper to select an ending based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the final ending screen based on trust level and allows starting a new game or returning to the title screen.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Shows available activities, applies trust and completion effects, unlocks moments, and closes after selection.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Lets players place discovered customization items in the library and view placed items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Displays dialogue nodes, filters choices by trust, updates trust and dialogue state, and handles closing the panel.",
  "frontend/src/game/ui/LettersPanel.tsx": "UI panel for writing letters, sending them, and viewing generated responses using game store state.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays unlockable story moments and plays selected moments, with locked states handled via game store.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause menu providing navigation to activities, settings, letters, moments, and reset options, with admin terminal support.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Provides audio settings UI including mute toggle and volume slider, with a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows current trust level with a labeled progress bar and color indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health via actor.isAvailable and exposes status, errors, and refetch controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context for Internet Identity, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for game state, actions, and progress updates with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables defining a warm color palette for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/startup.ts": "Startup module handling one-time initialization, asset preloading, storage checks, and reset utilities.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store providing a local-only admin gate with username-based unlock and persistence.",
  "frontend/src/state/useServerAccessStore.ts": "Empty placeholder file for server access store logic.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for unlocking and locking local admin mode with validation and feedback messages.",
  "frontend/src/ui/CreditsScreen.tsx": "Credits and about screen with game info, feature list, branding link, and a return button.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin-only diagnostic terminal overlay supporting commands, output logging, keyboard shortcuts, and store integration.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "UI component that displays game launch errors with user-friendly summaries and optional technical details.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches runtime errors during gameplay and shows a styled error screen with optional stack details.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Small status widget that shows backend server health as an online/offline/checking indicator.",
  "frontend/src/ui/terminal/commands.ts": "Implements terminal command parsing and execution for help, clearing output, diagnostics, and server status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into readable terminal lines for display.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal state, output lines, and input/output logging.",
  "frontend/src/ui/TitleScreen.tsx": "Main title menu UI with game start actions, server status indicators, admin controls, and offline notices.",
  "frontend/src/utils/launchErrorNormalization.ts": "Utility that converts raw launch errors into normalized categories and user-friendly summaries.",
  "frontend/STARTUP.md": "Documentation describing the app startup flow, initialization tasks, and extension instructions.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining metadata, existing features, and a pending feature request related to mobile look controls."
}