{
  "backend/main.mo": "Motoko backend defining game state, dialogue nodes, activities, memorable moments, and canister methods for starting and continuing games.",
  "feature_evidence.json": "Feature evidence report mapping two admin-gate features to impacted frontend files and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file used in the game.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed IC canister deployments.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables and base styles.",
  "frontend/index.html": "HTML entry point loading the React app root and main script.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational instructions for keeping the canister running and handling server offline errors.",
  "frontend/src/App.tsx": "Main React app orchestrating screens, startup, backend checks, game launching, and diagnostics.",
  "frontend/src/config/adminGate.ts": "Local admin gate config defining the case-sensitive ADMIN username and storage key.",
  "frontend/src/game/activities/activities.ts": "Defines activity data including trust effects, descriptions, and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Provides a Zustand-based audio manager handling volume, mute state, and background music playback with persistence.",
  "frontend/src/game/characters/Puro.tsx": "Renders the 3D Puro character with idle animation and click-to-start-dialogue interaction.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Implements touch-based joystick and look controls for mobile devices.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard, joystick, and look input into unified movement and camera control, respecting pause and terminal states.",
  "frontend/src/game/customization/customizationData.ts": "Lists available customization items with descriptions and valid placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines branching dialogue nodes with text, choices, trust effects, and optional trust requirements.",
  "frontend/src/game/GameView.tsx": "Main game container that initializes the game, renders the 3D scene, manages audio, and conditionally displays UI panels and pause logic.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates letter responses by selecting template text based on detected keywords in user content.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a drag-and-drop style book‑sorting game that adjusts trust and completes when all books are categorized.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Shows a slideshow of Puro’s drawings, rewarding trust as each is viewed and on full completion.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "Implements a timed hide‑and‑seek guessing game where trust changes based on speed and accuracy.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Provides a menu to launch mini‑games and handles switching and closing logic.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment scene with title, text, and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment metadata including scenes, descriptions, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library environment with movement, lighting, objects, and the Puro character.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store managing trust, dialogue state, progression, UI panels, and persistent game data with various update actions.",
  "frontend/src/game/story/endings.ts": "Defines ending data and a helper to select the correct ending based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Component that displays the final ending based on trust level and allows restarting or returning to title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Activity selection UI that adjusts trust, completes activities, unlocks moments, and closes after selection.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Panel for placing discovered customization items in the library and viewing already placed items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Dialogue interface that shows dialogue nodes, filters choices by trust, and updates trust and dialogue state.",
  "frontend/src/game/ui/LettersPanel.tsx": "Letter-writing UI where players send messages, receive generated responses, and view inbox messages.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of unlockable story moments and plays selected moments using MomentPlayer.",
  "frontend/src/game/ui/PauseMenu.tsx": "Provides a pause overlay with resume, navigation shortcuts, settings access, terminal access, and reset options.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Shows audio settings with mute and volume controls and a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Renders a trust meter card showing trust level, label, and color-coded progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor bound to the user's identity and invalidates queries when it changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health via actor.isAvailable and exposes status, timestamps, and a refetch method.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for game-related backend calls like state retrieval, choices, activities, customization, and progress reset.",
  "frontend/src/index.css": "Tailwind setup defining global CSS variables for light and dark themes and applying base typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider.",
  "frontend/src/startup.ts": "Runs one‑time startup checks including storage availability and asset preloading.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store managing a persisted local admin unlock state via username matching.",
  "frontend/src/state/useServerAccessStore.ts": "Zustand store for toggling and persisting server access enablement.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel that allows unlocking or locking local admin mode through a simple username gate.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays game credits, feature list, and a back button over a themed background.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin‑gated terminal overlay for diagnostic commands with input, output log, and keyboard shortcuts.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Error screen showing launch failure summary, technical details, and options to retry or return to title.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches game runtime errors and displays a styled error card with optional technical details.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "UI component that shows server availability status using icons and color-coded labels.",
  "frontend/src/ui/terminal/commands.ts": "Implements terminal command parser and executor for diagnostics, server access toggles, and status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into readable text lines for the in‑app terminal.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility and output line history.",
  "frontend/src/ui/TitleScreen.tsx": "Main title screen component providing game start controls, admin tools, server access toggle, and status display.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes launch-related errors into categorized, user-friendly messages with raw error details preserved.",
  "frontend/STARTUP.md": "Documentation explaining the frontend startup process and how to extend initialization logic.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, typography, plugins, and animations.",
  "project_state.json": "Stores project metadata, architectural notes, known issues, and feature definitions for a 3D library-based visual-novel/adventure game. Tracks requirements, backend constraints, and admin-gating logic updates."
}