{
  "backend/main.mo": "Motoko canister defining game state, dialogue structures, activities, moments, and save/load logic per caller.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file listing concise descriptions of key frontend source files and their roles.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed Internet Computer deployments.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables, light/dark modes, and base styles.",
  "frontend/index.html": "HTML entrypoint loading the root div and main TypeScript module.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide on keeping the canister running and handling availability issues.",
  "frontend/src/App.tsx": "Main React app component managing screens, startup, backend access, game launching, and diagnostics.",
  "frontend/src/config/adminGate.ts": "Config for local admin gate with username constant and derived storage key.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of activities with trust effects and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Zustand-powered audio manager that initializes background music, handles volume/mute state, and exposes controls.",
  "frontend/src/game/characters/Puro.tsx": "3D Puro character component with idle animation and interaction behavior to open dialogue on click.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Touch control overlay implementing joystick, look controls, and jump button for mobile devices.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard and mobile inputs into unified movement/look state and handles jump requests.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store storing joystick, look deltas, and jump flags with setters and reset logic.",
  "frontend/src/game/customization/customizationData.ts": "Defines customization items with placement options for decorating the environment.",
  "frontend/src/game/dialogue/dialogueData.ts": "Dialogue tree defining conversation nodes, choices, trust effects, and branching paths.",
  "frontend/src/game/GameView.tsx": "Main game view that initializes state, renders the 3D scene, handles audio, and toggles UI panels such as dialogue, activities, and pause menus.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates contextual letter responses based on keywords, choosing from friendly, curious, or encouraging presets.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "A book-sorting minigame where players categorize books to earn trust, with UI and drag/drop handling logic.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A drawing-viewing minigame letting players flip through Puro's drawings and gain trust for viewing all.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide-and-seek minigame where players guess Puro's hiding spot and earn trust based on speed.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "A launcher that displays a menu and loads one of several minigames, resetting on completion or close.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Renders a selected story moment with its scene text and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data entries including titles, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Three.js-based library scene handling player movement, jumping physics, camera tracking, and environment setup.",
  "frontend/src/game/state/useGameStore.ts": "Defines a persisted Zustand store for game state, including trust, dialogue, activities, customization, letters, endings, and UI flags with related update actions.",
  "frontend/src/game/story/endings.ts": "Defines available endings with trust thresholds and provides a helper to select the correct ending based on trust level.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the final ending based on trust level, unlocks it, and provides options to restart or return to the title screen.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Shows available activities, updates trust and activity completion, unlocks moments, and closes the menu after selection.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Allows placing discovered customization items in the library and displays both placed and available items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Renders dialogue nodes with choices that adjust trust and progress through the dialogue tree or close the panel.",
  "frontend/src/game/ui/LettersPanel.tsx": "Provides UI for writing letters, sending them to receive generated responses, and viewing the inbox.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of unlockable story moments and plays a selected moment when chosen.",
  "frontend/src/game/ui/PauseMenu.tsx": "Provides pause screen options including resuming, navigation to submenus, settings, and admin terminal access.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Renders audio settings with mute and volume controls and a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows the player's trust level with a label, color indicator, and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health using the actor and exposes status, errors, and a refetch method.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout, and identity loading via a React context.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend game operations with React Query hooks for fetching state and performing mutations.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables plus base typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/startup.ts": "Handles one‑time app startup, asset preloading, storage checks, and exposes reset for tests.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store managing a simple persisted admin unlock gate using a fixed username.",
  "frontend/src/state/useServerAccessStore.ts": "Zustand store that persists a toggle for enabling or disabling server access.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI card that lets users unlock or lock local admin mode and shows status feedback.",
  "frontend/src/ui/CreditsScreen.tsx": "Credits view showing game info, features, and a back button with background art.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin‑only diagnostic terminal overlay supporting command input and auto‑scrolling output.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays startup or launch errors with optional technical details and retry/back actions.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "A React error boundary that catches runtime errors during game rendering and shows a styled fallback with optional technical details and a return-to-title button.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Displays server availability using text and icons based on backend health and local server-access settings.",
  "frontend/src/ui/terminal/commands.ts": "Implements terminal command parsing and execution for diagnostics and local server-access control.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic state into human‑readable text lines for terminal output.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility, output lines, and input/output logging.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the main title screen with game actions, admin controls, server access toggle, and status indicator.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into user‑friendly summaries and categorized error types.",
  "frontend/STARTUP.md": "Documentation of the frontend startup flow and how initialization tasks execute.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Tracks project metadata, architectural notes, issues, and existing features for a 3D mobile-friendly visual-novel/adventure game. Contains design constraints, backend IC canister requirements, admin gating rules, and known build/runtime errors."
}