{
  "backend/main.mo": "Motoko canister defining game state, dialogue structures, activities, moments, letters, access control, and in‑memory maps for per‑user progress and profiles.",
  "feature_evidence.json": "Feature evidence report mapping implemented gameplay AI features to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their roles in UI, scenes, controls, state, and mini‑games.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed IC deployments with quick steps and checks.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark palette values, and global base styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide explaining IC canister uptime limits, availability checks, and steps to keep the backend running.",
  "frontend/src/App.tsx": "Main React app controller handling startup, screen navigation, backend checks, game launch logic, and diagnostics tracking.",
  "frontend/src/config/adminGate.ts": "Simple local‑only admin username gate with a configurable username and derived storage key.",
  "frontend/src/game/activities/activities.ts": "Defines activity data including IDs, descriptions, trust effects, and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Manages background music playback and audio settings via a persisted Zustand store.",
  "frontend/src/game/characters/Puro.tsx": "Renders the 3D Puro character with idle animation, hover effects, and dialogue-triggering click logic.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Implements mobile touch controls including joystick movement, look controls, and jump handling.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard and joystick input to produce movement and look values while respecting pause and terminal state.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store tracking joystick, look deltas, and one-shot jump requests with reset functionality.",
  "frontend/src/game/customization/customizationData.ts": "Static list of customization items with descriptions and allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines branching dialogue nodes with choices, trust effects, and optional trust requirements.",
  "frontend/src/game/enemies/types.ts": "Defines enemy state types and shared movement, detection, and visual constants.",
  "frontend/src/game/enemies/WhiteLatexBeast.tsx": "Implements an AI‑driven enemy that wanders, ambushes, and chases the player using Three.js and game constants.",
  "frontend/src/game/GameView.tsx": "Main game view that initializes the game, renders the 3D scene, HUD, overlays, and handles pause and mount events.",
  "frontend/src/game/letters/letterTemplates.ts": "Provides keyword‑based letter response generation from friendly, curious, and encouraging templates.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Mini‑game where players sort books into categories, affecting trust and showing feedback.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Mini‑game for viewing Puro’s drawings, tracking viewed items and adjusting trust.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "Timed mini‑game guessing Puro’s hiding spot with trust adjustments based on performance.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Launcher component that displays a menu and loads selected mini‑games.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a story moment with title, scene text, and close controls.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data objects with titles, scenes, and trust requirements.",
  "frontend/src/game/scene/HiveScene.tsx": "Implements a hive exploration scene with movement, jump physics, enemy encounters, and transfur event handling.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the library scene with movement, jumping, camera control, proximity-based teleporting, and optional wood textures.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store managing game state, UI visibility, trust, activities, transfur events, scenes, and persistence.",
  "frontend/src/game/state/useSettingsStore.ts": "Zustand store for persistent user settings, currently tracking aim sensitivity.",
  "frontend/src/game/story/endings.ts": "Defines available endings and selects one based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the final ending screen based on trust level with options to start a new game or return to the title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Activity selection UI that applies trust changes, completes activities, unlocks moments, and closes the menu.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Panel for placing discovered customization items in the library and viewing placed items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Renders a dialogue UI that displays the current dialogue node and filters choices based on trust, updating trust and navigation on selection.",
  "frontend/src/game/ui/LettersPanel.tsx": "Provides a letter-writing and inbox interface, validating input, sending letters, and generating delayed responses.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Shows a list of unlockable story moments and allows playing unlocked ones via a MomentPlayer component.",
  "frontend/src/game/ui/PauseMenu.tsx": "Implements the pause menu with navigation to activities, settings, letters, and admin tools, plus reset and resume actions.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Displays adjustable settings for audio volume, mute, and aim sensitivity with a back button.",
  "frontend/src/game/ui/TransfurOverlay.tsx": "Shows a timed fade-in and fade-out overlay with a message before calling a completion callback.",
  "frontend/src/game/ui/TrustMeter.tsx": "Displays the player's trust level with a colored label and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health using the actor and provides availability status, timestamps, errors, and a refetch helper.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking. Also wraps AuthClient creation with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods like fetching game state and performing game actions, invalidating queries on mutations. Intended only for online gameplay.",
  "frontend/src/index.css": "Tailwind CSS setup defining custom color variables for light and dark themes and applying base styling. Establishes global typography and background styles.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query and Internet Identity providers, and renders the App component.",
  "frontend/src/startup.ts": "Runs one-time startup tasks such as checking localStorage availability and preloading critical assets. Provides utilities to run and reset startup state.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store implementing a local-only admin unlock gate using a username match and persistent storage. Supports unlocking and relocking admin mode.",
  "frontend/src/state/useServerAccessStore.ts": "Empty placeholder file for future server access state management.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for unlocking and managing local admin mode with feedback messages, using Zustand state. Includes warnings about its non-secure nature.",
  "frontend/src/ui/CreditsScreen.tsx": "Credits and about screen with game description, features list, and external link attribution. Includes background styling and a back button.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Renders an admin-accessible in-game terminal overlay with input handling, output scrolling, and command execution.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays user‑friendly and technical details for game launch failures with retry and navigation options.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "Catches runtime rendering errors and shows a fallback UI with optional stack details and return-to-title action.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Shows backend server health as a colored status indicator based on availability state.",
  "frontend/src/ui/terminal/commands.ts": "Parses and executes allowed diagnostic terminal commands, including app and server status queries.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic state into readable lines for terminal display.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility, input/output lines, and message logging.",
  "frontend/src/ui/TitleScreen.tsx": "Implements the game's title menu with launch options, admin tools, and server status/offline notices.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into user-friendly summaries with categorized error types.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash params.",
  "frontend/STARTUP.md": "Documentation detailing the app's startup sequence, initialization tasks, and extension instructions.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and enabled plugins.",
  "project_state.json": "Tracks project state, requirements, and feature requests for implementing ambush-triggered chase behavior."
}