{
  "backend/main.mo": "Motoko canister defining game state, dialogue, activities, moments, and save data with functions to start or continue a game.",
  "feature_evidence.json": "Feature evidence report listing implemented gameplay features, linked files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend source files for reference during build planning.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide outlining steps to diagnose and retry failed Internet Computer deployments.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, theme variables, and light/dark mode palettes.",
  "frontend/index.html": "Basic HTML entry file mounting the root element and loading the React application.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide explaining canister availability, uptime limitations, and how to keep the backend running.",
  "frontend/src/App.tsx": "Main React app managing screens, startup flow, backend availability, and game launch logic with diagnostics.",
  "frontend/src/config/adminGate.ts": "Config file defining the local admin username and the derived storage key for admin gate state.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of preset activities with trust effects and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Provides a Zustand-based audio manager for volume, mute state, and looping background music playback.",
  "frontend/src/game/characters/Puro.tsx": "Three.js Puro character model with idle animation, hover effects, and click-to-open dialogue behavior.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Mobile-only control overlay implementing touch joystick movement, look controls, and jump button.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard and mobile input into unified movement/look state and handles jump events.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store tracking joystick, look deltas, and one-shot jump requests with reset helpers.",
  "frontend/src/game/customization/customizationData.ts": "Defines customization item metadata, including descriptions and allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Contains dialogue nodes and choices forming a branching dialogue tree with trust effects and requirements.",
  "frontend/src/game/GameView.tsx": "Top-level game container managing initialization, canvas rendering, UI overlays, scene switching, and pause handling.",
  "frontend/src/game/letters/letterTemplates.ts": "Defines preset friendly, curious, and encouraging response lists and a function that selects one based on keywords in a letter.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a drag-and-drop-style book sorting minigame that adjusts trust and signals completion when all books are placed correctly.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Displays a gallery of Puro’s drawings, tracking viewed items and adjusting trust as the player browses.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "Runs a timed hide‑and‑seek minigame where the player guesses Puro’s location, affecting trust based on speed and accuracy.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Provides a menu to launch individual minigames and handles transitions and closing behavior.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Renders a cinematic moment with a title, scene text, and close control.",
  "frontend/src/game/moments/momentsData.ts": "Exports moment definitions containing text scenes and trust requirements.",
  "frontend/src/game/scene/HiveScene.tsx": "Defines a 3D hive environment with player movement, jumping physics, camera control, and procedural tree placement.",
  "frontend/src/game/scene/LibraryScene.tsx": "Controls player movement, jumping, camera following, and proximity-based teleport triggers in the 3D library scene.",
  "frontend/src/game/state/useGameStore.ts": "Defines the game's global Zustand store with UI flags, progression data, scene state, and actions for updating trust, activities, letters, and navigation.",
  "frontend/src/game/story/endings.ts": "Contains ending definitions with trust thresholds and a helper to select the correct ending for a given trust level.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the final ending based on trust level, unlocks it, and provides options to start a new game or return to the title screen.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Renders selectable activities that modify trust, mark activities complete, unlock moments, and close the menu.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Lets players place discovered customization items in the library and shows both placed and available items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Manages dialogue nodes, applies trust effects from choices, filters choice availability, and handles closing dialogue.",
  "frontend/src/game/ui/LettersPanel.tsx": "UI panel for writing letters, sending them, and viewing generated responses using game state.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays unlockable story moments and allows playing them if unlocked.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause menu offering resume, quick navigation, settings, resets, and admin terminal access.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Audio settings screen allowing mute toggling and volume adjustment.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows current trust level with color-coded label and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health status using the actor and provides availability info with refetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend game actions and state, each calling actor methods and refreshing the gameState query.",
  "frontend/src/index.css": "Defines Tailwind base imports and custom CSS variables for light/dark themes with a warm color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/src/startup.ts": "Manages one‑time app initialization including asset preloading, storage checks, and startup state tracking.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store implementing a local-only admin unlock gate with persistent unlocked state.",
  "frontend/src/state/useServerAccessStore.ts": "Empty placeholder file for a Zustand store related to server access.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for unlocking or locking admin mode using the admin gate store with basic feedback messages.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays a styled credits screen with game info, external link attribution, and a back button.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin-only diagnostic terminal overlay with command execution, keyboard shortcuts, scrolling output, and input handling.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays a user-friendly launch error screen with retry/back navigation and optional technical details based on diagnostics state.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "Catches runtime rendering errors in the game and shows a fallback UI with optional stack details and a button to return to title.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Shows a small status badge indicating backend health as online, offline, or checking.",
  "frontend/src/ui/terminal/commands.ts": "Implements a restricted terminal command handler supporting help, clear, diagnostics, and server status queries.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into printable terminal lines.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility, input/output history, and state updates.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the game's title menu with game start options, server status indicators, offline notices, and admin controls.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw backend launch errors into user-friendly summaries with categorized error types.",
  "frontend/STARTUP.md": "Documentation describing the app startup flow, initialization tasks, and how to extend the startup process.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, colors, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project metadata describing a 3D game where touching Puro teleports the player to a generated white latex forest, along with features and pending requests."
}