{
  "backend/main.mo": "Defines game state types, dialogue nodes, activities, memorable moments, and exposes canister methods for starting and continuing a game.",
  "backend/migration.mo": "Stub migration module that returns the old actor state unchanged.",
  "feature_evidence.json": "Feature evidence report listing added troubleshooting documents, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of frontend source files across UI, game systems, scenes, and state management.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Developer guide explaining how to retry failed deployments and verify canister status.",
  "frontend/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide for maintaining canister availability and handling stopped or out‑of‑cycles states.",
  "frontend/src/App.tsx": "Main React app managing screens, startup, backend availability checks, game launching, and diagnostics.",
  "frontend/src/config/adminGate.ts": "Config for a simple local admin username gate and associated storage key.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of activities that affect trust and may unlock moments.",
  "frontend/src/game/audio/useAudio.ts": "Implements a Zustand-based audio manager with volume, mute control, and background music playback.",
  "frontend/src/game/characters/Puro.tsx": "Renders the 3D Puro character with idle animation, hover effects, and click-to-open dialogue behavior.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Provides touch-based joystick and look controls for mobile devices with event handling and movement updates.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard, joystick, and look inputs into a unified movement and camera control state.",
  "frontend/src/game/customization/customizationData.ts": "Lists customizable room items with names, descriptions, and allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines a dialogue tree with nodes, choices, trust effects, and branching conversation paths.",
  "frontend/src/game/GameView.tsx": "Main in‑game view rendering the 3D scene, HUD, menus, initialization logic, and pause system.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates letter responses based on keyword detection using friendly, curious, or encouraging templates.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a book-sorting minigame where correct categorization affects trust and completes when all books are sorted.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A mini-game where players view a sequence of drawings, earning trust for each one viewed and a bonus for finishing all.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide-and-seek game where players guess hiding spots, affecting trust based on speed and accuracy.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Provides a menu to launch different mini-games and handles transitioning between them.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with a title, scene text, and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines the Moment interface and a list of unlockable narrative moments with trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library environment, handling player movement, camera control, and scene objects including Puro.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store managing UI state, trust, progress, customizations, letters, moments, and endings with persistence.",
  "frontend/src/game/story/endings.ts": "Defines ending types, a list of endings with trust thresholds, and a helper to select an ending based on trust level.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the ending based on trust level, unlocks it, and provides options to restart or return to title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Renders an activity selection menu that adjusts trust, completes activities, and unlocks moments.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Allows placing discovered customization items in the library and displays placed and available items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Shows dialogue nodes with choices that may affect trust and advance or close the conversation.",
  "frontend/src/game/ui/LettersPanel.tsx": "Lets players write letters and view responses, managing sending, validation, and inbox display.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays unlockable story moments and plays them when selected.",
  "frontend/src/game/ui/PauseMenu.tsx": "Provides pause options including resume, quick navigation, settings, resets, and admin terminal access.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Offers audio settings including mute toggle and volume slider with a back option.",
  "frontend/src/game/ui/TrustMeter.tsx": "Displays a trust meter using a progress bar and color-coded label based on trust level from game state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health via actor.isAvailable and exposes status, timing, errors, and a refetch method.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for game actions and state retrieval, invalidating gameState on mutations.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes with a warm color palette.",
  "frontend/src/main.tsx": "Bootstraps the app with QueryClient and InternetIdentityProvider, rendering App to the root element.",
  "frontend/src/startup.ts": "Runs one-time startup tasks including storage checks and asset preloading, with reset functionality.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store providing a simple local-only username gate for unlocking admin mode.",
  "frontend/src/state/useServerAccessStore.ts": "Zustand store persisting a toggle for enabling or disabling server access.",
  "frontend/src/ui/AdminAccessPanel.tsx": "Admin panel UI allowing users to unlock or lock admin mode with feedback and warnings.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays the Credits screen with description, features, and a backlink button.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Renders an admin-only diagnostic terminal with command input, output log, shortcuts, and server status checks.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Shows a launch error message with retry/back options and optional technical details.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "Error boundary that catches runtime errors, displays a fallback UI, and shows optional technical details.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Visual indicator showing backend status (online, offline, checking, or disabled).",
  "frontend/src/ui/terminal/commands.ts": "Implements terminal command handling for help, clear, server controls, status checks, and diagnostics output.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Defines diagnostics data and formats it into readable terminal lines describing app state and launch info.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Implements a Zustand store managing terminal visibility and input/output lines with append and clear functions.",
  "frontend/src/ui/TitleScreen.tsx": "Main title screen with game start options, admin tools, server toggle, and status indicator.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into categorized user-friendly summaries for canister, save, and connectivity issues.",
  "frontend/STARTUP.md": "Documentation of the app’s startup sequence, initialization steps, and extension guidelines.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata including summary, architecture notes, known issues, and existing feature definitions."
}