{
  "backend/main.mo": "Motoko canister defining dialogue, activities, moments, letters, user profiles, and per-user game state with access-control mixin integration.",
  "feature_evidence.json": "Metadata file listing implemented features, associated source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to concise functional summaries of each component or system.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide explaining how to diagnose and retry failed Internet Computer canister deployments.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, theme variables, and dark mode overrides.",
  "frontend/index.html": "Base HTML file loading the React entrypoint and providing the root DOM container.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Ops document describing how to keep the canister running and troubleshoot availability issues.",
  "frontend/src/App.tsx": "Main application component managing screens, startup flow, backend availability checks, and game launch logic with diagnostics.",
  "frontend/src/config/adminGate.ts": "Configuration module defining the local admin username and derived storage key for admin access gating.",
  "frontend/src/game/activities/activities.ts": "Defines activity data including trust effects and optional moment unlocks for in‑game interactions.",
  "frontend/src/game/audio/useAudio.ts": "Manages audio settings with Zustand and provides background music playback with persistent volume and mute state.",
  "frontend/src/game/characters/Puro.tsx": "Renders the Puro character as a sprite with hover effects, idle animation, and dialogue interaction handling.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Provides touch‑based joystick, look controls, and jump input for mobile devices, disabling controls when paused or terminal is open.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard, joystick, and look inputs into unified movement and camera deltas while respecting pause and terminal states.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store holding joystick, look delta, and jump request state used by player control logic.",
  "frontend/src/game/customization/customizationData.ts": "Defines available customization items and their possible placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Contains dialogue tree nodes, choices, trust effects, and branching logic for conversations with Puro.",
  "frontend/src/game/enemies/types.ts": "Defines enemy state types and shared constants for movement, detection, and behavior settings.",
  "frontend/src/game/enemies/WhiteLatexBeast.tsx": "Implements an AI-driven enemy that wanders, ambushes, and chases the player using Three.js and a state machine.",
  "frontend/src/game/GameView.tsx": "Main game view component that initializes the game, renders the 3D canvas and HUD overlays, and manages pause state and scene switching.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates contextual letter responses based on keywords using predefined friendly, curious, and encouraging templates.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "A drag-and-drop style book categorization minigame that adjusts trust and reports completion.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A drawing viewer minigame where viewing each drawing increases trust and completion rewards additional trust.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed guessing miniggame where the player searches for Puro, with trust changes based on guesses and time remaining.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Launches and navigates between available minigames with a simple menu and close handling.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with title, scene text, and a close button inside a modal-style card.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data entries including titles, scenes, and trust requirements for unlocking them.",
  "frontend/src/game/scene/HiveScene.tsx": "3D hive scene handling player movement, jumping, enemy encounters, and transfur capture logic with procedural tree generation.",
  "frontend/src/game/scene/LibraryScene.tsx": "Library scene with player movement, jumping, camera control, Puro proximity detection, and wood texture loading.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store managing game state, UI visibility, trust, activities, transfurs, scenes, and persistence.",
  "frontend/src/game/state/useSettingsStore.ts": "Zustand store for player settings, currently storing and persisting aim sensitivity.",
  "frontend/src/game/story/endings.ts": "Defines ending data and selects an ending based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Component displaying the final ending based on trust and offering new‑game or title‑screen options.",
  "frontend/src/game/ui/ActivityMenu.tsx": "UI menu listing activities that modify trust, unlock moments, and close after selection.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Panel for placing discovered customization items in the library and viewing placed items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Dialogue UI that displays the current dialogue node, filters choices by trust level, and updates trust and dialogue state on selection.",
  "frontend/src/game/ui/LettersPanel.tsx": "Panel for writing letters and viewing inbox, sending messages with validation and generating delayed responses.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Lists unlockable moments and allows playing unlocked ones through a dedicated player component.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause menu providing resume, navigation to various game sections, settings access, and optional admin terminal.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Settings UI allowing audio controls and aim sensitivity adjustments with a back button.",
  "frontend/src/game/ui/TransfurOverlay.tsx": "Timed fade-in/out overlay showing a transfur message and calling a completion callback.",
  "frontend/src/game/ui/TrustMeter.tsx": "Displays trust level with label, color-coded icon, and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health using an actor with React Query and provides status, errors, and a refetch method.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading identities, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend game operations such as fetching state and performing mutations like starting games or making choices.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines a warm color palette with light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/startup.ts": "Handles one‑time startup tasks including asset preloading, storage checks, and maintaining initialization state.",
  "frontend/src/state/useAdminGateStore.ts": "Implements a persisted Zustand store providing a simple username-based local admin unlock gate.",
  "frontend/src/state/useServerAccessStore.ts": "Empty file placeholder for a future Zustand server access store.",
  "frontend/src/ui/AdminAccessPanel.tsx": "Renders a local admin access UI allowing unlock via username and displaying lock/unlock feedback.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays the game's credits and about section with themed styling and a back button.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Renders an admin‑gated diagnostic terminal overlay with input handling, auto‑scrolling, and command execution.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays a launch failure screen summarizing errors with optional technical details and retry/back navigation.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "Implements an error boundary that catches runtime errors during game rendering and shows a recovery UI with details.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Shows a small status badge indicating backend server health based on availability state.",
  "frontend/src/ui/terminal/commands.ts": "Parses and executes a small set of terminal commands, including diagnostics and backend status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into readable text lines for terminal display.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility, input/output lines, and state updates.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the main title screen with game actions, admin tools, server status, and offline mode notices.",
  "frontend/src/utils/launchErrorNormalization.ts": "Provides a function to convert raw launch errors into categorized, user-friendly summaries for game startup actions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash routing support.",
  "frontend/STARTUP.md": "Documentation outlining the frontend startup sequence, responsibilities, and extension guidelines.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file tracking project metadata, feature requirements, issues, and required image assets."
}