{
  "backend/main.mo": "Motoko canister defining game state, dialogue, activities, moments, and player progression with start/continue APIs.",
  "feature_evidence.json": "Report mapping implemented features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables and light/dark mode colors.",
  "frontend/index.html": "Base HTML entry point loading the React application.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Guide outlining canister uptime limitations and operational steps for keeping the backend running.",
  "frontend/src/App.tsx": "Root React component handling startup, screen navigation, backend calls, server-access gating, and diagnostics.",
  "frontend/src/game/activities/activities.ts": "Defines activity data including trust effects, descriptions, and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Manages audio settings and background music playback using a persisted Zustand store.",
  "frontend/src/game/characters/Puro.tsx": "3D Puro character component with idle animation and click/hover interactions that trigger dialogue.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Touch-based joystick and look controls for mobile devices, updating player movement and camera look.",
  "frontend/src/game/controls/usePlayerControls.ts": "Aggregates keyboard, joystick, and look input into normalized movement and look deltas, respecting pause and terminal states.",
  "frontend/src/game/customization/customizationData.ts": "Lists customization items with descriptions and allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Contains dialogue nodes and choices forming a branching dialogue tree with trust effects and requirements.",
  "frontend/src/game/GameView.tsx": "Main game view component that initializes state, mounts the 3D scene, manages UI panels, audio, and pause handling.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates contextual letter responses based on keywords, using friendly, curious, or encouraging templates.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "A drag-and-drop book sorting game that adjusts trust based on correct or incorrect placements and signals completion when all books are sorted.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A drawing viewer that lets players browse Puro's sketches, increasing trust when new drawings are viewed and awarding a bonus when all are seen.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide‑and‑seek guessing game where players choose hiding spots, affecting trust based on speed and accuracy.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Launches and manages transitions between available minigames, returning to a menu when games finish or close.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with title, scene text, and a close button in a modal-style layout.",
  "frontend/src/game/moments/momentsData.ts": "Defines Moment data with titles, descriptions, scenes, and trust requirements for story moments.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library environment with movement controls, lighting, props, and the Puro character, updating camera and player position each frame.",
  "frontend/src/game/state/useGameStore.ts": "Defines a persisted Zustand store managing trust, dialogue, activities, items, letters, endings, and UI visibility, with actions to update each.",
  "frontend/src/game/story/endings.ts": "Declares ending definitions with trust thresholds and provides a function to select an ending based on trust level.",
  "frontend/src/game/story/EndingScene.tsx": "Renders the final ending scene based on trust level and allows starting a new game or returning to the title screen.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Displays available activities, updates trust and completed activities, unlocks moments, and closes the menu on selection.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Shows discovered and placed customization items, letting players place new items in the library.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Handles dialogue display and branching choices, updating trust and navigating dialogue nodes.",
  "frontend/src/game/ui/LettersPanel.tsx": "Allows writing letters, auto-generates delayed responses, and displays inbox messages.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of moments, showing locked/unlocked status and allowing playback of unlocked moments.",
  "frontend/src/game/ui/PauseMenu.tsx": "Renders the pause menu with resume, navigation shortcuts, settings, terminal access, and progress reset options.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Provides UI controls for audio mute and volume settings with a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows the player's trust level with a label, color indicator, and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend availability via actor.isAvailable and exposes status, errors, and refetching utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, login flow, and context access.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for game-related backend calls, including game state, actions, and progress updates.",
  "frontend/src/index.css": "Defines Tailwind layers and a warm color palette with light and dark theme CSS variables and base typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders the root component.",
  "frontend/src/startup.ts": "Handles one-time app initialization including storage checks and critical asset preloading with idempotent startup control.",
  "frontend/src/state/useServerAccessStore.ts": "Zustand store managing a persisted boolean flag for enabling or disabling server access.",
  "frontend/src/ui/CreditsScreen.tsx": "Renders a credits page with game info, features, and a link attribution, including a background image and back button.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Implements an in‑game diagnostic terminal with input handling, command execution, keyboard shortcuts, and scrollable output.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays launch‑time error details with user‑friendly messaging, expandable technical info, and retry or back‑to‑title actions.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "A React error boundary that catches runtime errors in the game, shows an error screen, and allows viewing technical details.",
  "frontend/src/ui/terminal/commands.ts": "Defines terminal command handling for diagnostics, server-access toggles, and server status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into readable terminal output lines for debugging.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Implements a Zustand store for terminal state, output history, and input/output append helpers.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the main title screen UI with server-access toggles, server status alerts, and buttons for game actions.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into user-friendly summaries with categorized error types.",
  "frontend/STARTUP.md": "Documentation of the frontend startup process, initialization tasks, and extension guidelines.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, container queries, and animations.",
  "project_state.json": "Contains project metadata, architectural notes, known issues, and feature tracking information."
}