{
  "backend/main.mo": "Motoko canister defining game state, dialogue nodes, activities, moments, and APIs for starting and continuing a game.",
  "feature_evidence.json": "Feature evidence report mapping implemented admin-gating features to related files, components, and requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files used for reference in build planning.",
  "frontend/index.css": "Tailwind root theme variables and global styles defining color tokens for light and dark modes.",
  "frontend/index.html": "Base HTML file loading the app root and main TypeScript entry module.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide explaining canister uptime limits and steps to keep the backend running.",
  "frontend/src/App.tsx": "Main React app orchestrating screen navigation, startup sequence, backend checks, and game launch flow.",
  "frontend/src/config/adminGate.ts": "Config file defining the admin username and localStorage key for admin-gate state.",
  "frontend/src/game/activities/activities.ts": "Defines activity metadata including trust effects and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Manages audio settings and background music playback with persistent volume and mute state.",
  "frontend/src/game/characters/Puro.tsx": "Renders the 3D Puro character with idle animation and click-to-start-dialogue interaction.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Implements touch joystick and look controls for mobile devices with touch event handling.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard, terminal, and joystick input to produce normalized movement and look vectors.",
  "frontend/src/game/customization/customizationData.ts": "Provides available customization items and their possible placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines dialogue tree nodes with branching choices and trust effects.",
  "frontend/src/game/GameView.tsx": "Main game container that initializes state, renders the 3D scene, and conditionally displays UI panels and pause logic.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates contextual letter responses based on keyword detection in the player's message.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "A drag-and-drop style minigame where players sort books into categories and gain or lose trust based on accuracy.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A slideshow-style minigame letting players view Puro's drawings, increasing trust as each drawing is viewed.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed guessing minigame where players try to find Puro's hiding spot, affecting trust based on speed and accuracy.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "A launcher UI that opens and closes different minigames and returns to a selection menu when one finishes.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a selected story moment with title and scene text and allows closing the viewer.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data entries with IDs, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Three.js scene defining the library environment, player movement, lighting, props, and interactions for the game world.",
  "frontend/src/game/state/useGameStore.ts": "Defines a persistent Zustand store managing game state, UI visibility, trust levels, progression, and related update actions.",
  "frontend/src/game/story/endings.ts": "Contains ending definitions with trust thresholds and a helper to select the correct ending by trust level.",
  "frontend/src/game/story/EndingScene.tsx": "Renders the final ending scene based on trust level and provides options to restart the game or return to the title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Shows available activities, updates trust and progression on selection, and closes after an activity is chosen.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Displays discovered and placed customization items and allows placing new items in the library.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Handles dialogue flow, updating trust and moving between dialogue nodes based on player choices.",
  "frontend/src/game/ui/LettersPanel.tsx": "Allows writing letters and viewing responses, storing them in game state with delayed automated replies.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of moments, showing locked or unlocked status, and plays a selected moment via MomentPlayer.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause overlay offering resume, quick-access menus, settings, reset, and optional admin terminal.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Settings panel allowing audio mute and volume control with a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows current trust level with color-coded label and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health using the actor and exposes status, timestamps, and refetching utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend game operations such as fetching state, starting games, making choices, and updating progress.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes with a warm color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/startup.ts": "Handles one‑time startup initialization, including asset preloading and storage checks, with reset support.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store providing a persisted local‑only username gate to unlock or lock admin mode.",
  "frontend/src/state/useServerAccessStore.ts": "Zustand store for toggling and persisting a boolean flag controlling server access.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for entering a username to unlock admin mode, showing status and allowing relocking.",
  "frontend/src/ui/CreditsScreen.tsx": "Credits screen showing game info, feature list, and a link attribution, with a button to return.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin‑gated diagnostic terminal overlay supporting command input, output scrolling, and hotkeys.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays user‑friendly and detailed error info when game launch fails, with retry and back actions.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches game runtime errors, shows a user message, and optionally displays stack details with a back-to-title button.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Displays server availability status with an icon and color based on backend health and local server-access toggle.",
  "frontend/src/ui/terminal/commands.ts": "Implements terminal command handling for diagnostics and local server-access toggling with output routing.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic state into readable text lines for the in‑app terminal.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility and logging of input/output lines.",
  "frontend/src/ui/TitleScreen.tsx": "Main title screen UI providing game start actions, admin panel access, server-access controls, and server status display.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into categorized, user-friendly messages for game start and continue actions.",
  "frontend/STARTUP.md": "Documentation describing the frontend startup flow, runStartup behavior, and how to extend initialization logic.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s current design, architecture notes, known issues, and implemented features for a 3D library-based adventure/visual-novel hybrid. Includes backend IC canister requirements, startup constraints, and multiple unresolved scope conflicts."
}