{
  "backend/main.mo": "Motoko canister defining game state, dialogue nodes, activities, moments, and player save data with APIs to start and continue games.",
  "feature_evidence.json": "Feature evidence listing implemented features, involved files, components, and test IDs for backend availability checks and operations docs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including UI screens, game systems, scenes, minigames, and state management.",
  "frontend/index.css": "Tailwind CSS root theme variables and dark mode definitions with base styles for the application.",
  "frontend/index.html": "Main HTML entry file defining root container and loading the frontend bundle.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Developer guide explaining how to keep the canister running, limitations around canister restarts, and operational responsibilities.",
  "frontend/src/App.tsx": "Root React component handling startup, navigation, backend availability checks, and orchestrating game launch with diagnostics.",
  "frontend/src/game/activities/activities.ts": "Activity definitions listing gameplay actions, trust effects, completion messages, and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Zustand-based audio store and hook that initializes looping background music and manages volume, mute state, and playback.",
  "frontend/src/game/characters/Puro.tsx": "React Three Fiber component rendering Puro with idle animation and interaction handlers for dialogue and hover effects.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Mobile touch overlay providing joystick movement and look controls via touch events for player input.",
  "frontend/src/game/controls/usePlayerControls.ts": "Hook combining keyboard, joystick, and look inputs to produce normalized movement and camera delta values.",
  "frontend/src/game/customization/customizationData.ts": "Static list of customizable room items with descriptions and allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines structured dialogue nodes and choices with trust effects for Puro's branching conversation system.",
  "frontend/src/game/GameView.tsx": "Main in‑game view rendering the 3D scene, HUD, panels, mobile controls, and pause/ending flows with initialization hooks.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates contextual letter responses based on keywords using predefined friendly, curious, and encouraging templates.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "React UI minigame where players sort books into categories, affecting trust and signaling completion.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A mini-game where players view drawings, adjust trust when viewing each, and navigate between them before completing.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide-and-seek mini-game where players guess hiding spots, affecting trust based on success or failure.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Launches selectable mini-games and returns to a menu after each one completes.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with title, scene text, and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines the Moment interface and provides preset story moment data with trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library environment, handling player movement, camera control, textures, and scene objects like Puro.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store managing trust, UI flags, game progress, customization, letters, endings, and related actions.",
  "frontend/src/game/story/endings.ts": "Defines ending interfaces and a list of endings chosen by trust thresholds, plus a helper to fetch the appropriate ending.",
  "frontend/src/game/story/EndingScene.tsx": "Shows the ending scene based on trust, unlocks it, and provides options to restart or return to title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Renders an activities menu where selecting an activity adjusts trust, completes it, and may unlock moments.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Displays discovered customization items and allows placing them in the library while listing existing placements.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Shows dialogue nodes with choices that affect trust and navigate the dialogue tree.",
  "frontend/src/game/ui/LettersPanel.tsx": "Allows writing letters and viewing responses, enforcing length limits and generating delayed replies.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Lists collectible story moments, showing locked or unlocked states and enabling playback of unlocked ones.",
  "frontend/src/game/ui/PauseMenu.tsx": "Provides pause controls, quick-access navigation, settings access, and progress reset confirmation.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Presents audio settings including mute and volume controls with a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Displays the player's trust level with dynamic labels, colors, and a progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health status using the actor and exposes availability state and refetch controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login flow.",
  "frontend/src/hooks/useQueries.ts": "Wraps game-related backend calls in React Query hooks for fetching state and performing gameplay mutations.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color palette for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, Internet Identity provider, and React Query client.",
  "frontend/src/startup.ts": "Runs one-time startup checks like asset preloading and storage availability, with reset support.",
  "frontend/src/ui/CreditsScreen.tsx": "Renders the game's credits screen with description, features, and a back button.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "React UI screen that displays startup/launch failures with optional technical details and retry or back-to-title actions.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches runtime rendering errors and shows a fallback UI with toggleable stack details and a return-to-title button.",
  "frontend/src/ui/TitleScreen.tsx": "Main title screen UI showing game logo, server health warnings, and buttons for starting, continuing, settings, and credits.",
  "frontend/src/utils/launchErrorNormalization.ts": "Utility that parses raw launch errors into user-friendly summaries and categorizes them for display during game startup.",
  "frontend/STARTUP.md": "Documentation describing the frontend startup flow, initialization tasks, invocation, and extension guidance.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Project metadata capturing game concept, architecture notes, known issues, and existing implemented features."
}