{
  "backend/main.mo": "Motoko canister defining dialogue structures, activities, moments, letters, and player game state with start/continue game functions and initial dialogue/activity data.",
  "feature_evidence.json": "Feature evidence report documenting a UI change to replace the 'Local Offline' server status label with 'Online' in admin server controls.",
  "frontend-file-summaries.txt": "JSON map summarizing all major frontend files including UI screens, game systems, scenes, controls, state, dialogue, activities, minigames, and customization.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed IC deployments with steps for checking canister status and redeploying.",
  "frontend/index.css": "Tailwind base configuration defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Main HTML entry point loading the React app root and main script.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide explaining canister uptime limits and how to keep the game canister running.",
  "frontend/src/App.tsx": "Main React app managing screen navigation, startup, backend availability checks, admin server access rules, and game launch flow.",
  "frontend/src/config/adminGate.ts": "Defines local-only admin username and storage key for unlocking admin features.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of activity objects that affect trust and may unlock moments.",
  "frontend/src/game/audio/useAudio.ts": "Provides a Zustand-based audio manager handling volume, mute state, and background music playback.",
  "frontend/src/game/characters/Puro.tsx": "Renders the Puro character with idle animation, hover effects, and click-triggered dialogue.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Implements mobile touch controls including a joystick, look controls, and jump button with pause/terminal handling.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard and joystick inputs, manages look/jump actions, and outputs normalized movement.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store maintaining joystick, look deltas, and jump request state with reset and consume logic.",
  "frontend/src/game/customization/customizationData.ts": "Lists customization items with descriptions and allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Defines dialogue nodes and branching choices affecting trust and conversation flow.",
  "frontend/src/game/GameView.tsx": "Renders the main 3D game canvas and UI panels, initializes game state, handles audio, pause menu, and scene mount lifecycle.",
  "frontend/src/game/letters/letterTemplates.ts": "Provides letter response templates and selects replies based on keyword analysis.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "A drag-and-drop style game where players sort shuffled books into categories and gain or lose trust points.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A slideshow-style viewer of Puro's drawings where viewing each piece increases trust.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide-and-seek guessing game where players search for Puro among preset hiding spots.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "A launcher menu that opens and closes the various mini-games and routes between them.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a story moment with title, scene text, and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data objects containing titles, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "A 3D library scene with player movement, jumping physics, camera control, and optional wood textures.",
  "frontend/src/game/state/useGameStore.ts": "Defines a persisted Zustand store managing trust, dialogue, activities, customizations, letters, endings, and UI panel visibility with actions to modify each.",
  "frontend/src/game/story/endings.ts": "Provides ending definitions with trust thresholds and a helper to select the correct ending based on trust level.",
  "frontend/src/game/story/EndingScene.tsx": "Renders the ending scene based on trust level, unlocks the ending, and offers options to start a new game or return to title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Displays available activities, applies trust changes and activity completion, unlocks moments, and closes the menu.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Shows discovered and placed customization items, allowing players to place items in the library and update the store.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Handles dialogue progression with trust-based choices, updating dialogue nodes and closing the panel when finished.",
  "frontend/src/game/ui/LettersPanel.tsx": "Allows writing letters, queues automated responses, and displays an inbox of sent letters and replies.",
  "frontend/src/game/ui/MomentsMenu.tsx": "UI menu listing unlockable story moments and launching the MomentPlayer when selected.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause screen providing resume, quick-access navigation, settings, reset, and optional admin terminal access.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Settings panel allowing mute toggle and volume adjustment with a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Displays current trust level with a label, color, and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health via actor.isAvailable and exposes status state and a helper for one-off checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and status handling via context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for game state and mutations like choices, activities, customization, moments, letters, and progress reset.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables and base typography.",
  "frontend/src/main.tsx": "Bootstraps React app with React Query and Internet Identity provider, importing global CSS.",
  "frontend/src/startup.ts": "Handles one-time startup initialization including storage checks and asset preloading with reset support.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store providing a persistent local admin unlock gate based on a username match.",
  "frontend/src/state/useServerAccessStore.ts": "Zustand store managing persistent toggling of server access settings.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for unlocking or locking admin mode with username input and feedback messaging.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays credits, feature list, and a return button with a themed background.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin-gated in‑app terminal overlay supporting commands, keyboard shortcuts, and scrollable output.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Error screen summarizing launch failures with optional technical details and retry/back controls.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches game runtime errors and displays a detailed UI with optional stack traces and a return-to-title button.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Visual indicator showing server availability based on app toggle and backend health state.",
  "frontend/src/ui/terminal/commands.ts": "Implements terminal command parsing and execution for diagnostics, server toggles, and status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic state into readable terminal output lines.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility and output history.",
  "frontend/src/ui/TitleScreen.tsx": "Main title menu UI with game actions, admin panel, server-access controls, and server status indicator.",
  "frontend/src/utils/launchErrorNormalization.ts": "Utility that converts raw launch errors into categorized, user-friendly summaries.",
  "frontend/STARTUP.md": "Documentation of the startup flow, detailing startup tasks, invocation, and extensibility.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with custom colors, fonts, animations, and plugin setup.",
  "project_state.json": "Structured project metadata describing the game’s concept, architecture notes, known issues, and existing feature records for a 3D library-set adventure/visual novel. Includes canister backend constraints, admin-gating requirements, and multiple reported startup/runtime errors."
}