{
  "backend/main.mo": "Motoko canister defining dialogue, activities, moments, letters, and per-player game state with start/continue methods and basic availability query.",
  "feature_evidence.json": "Feature evidence report mapping offline‑mode and gameplay‑persistence features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of key frontend files including app flow, UI screens, game systems, and state management.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed Internet Computer deployments.",
  "frontend/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry file that mounts the React app and loads main.tsx.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide covering canister uptime, status checks, and limits around automatic restarts.",
  "frontend/src/App.tsx": "Main app component handling startup, screen routing, backend availability checks, and offline/online game launch logic.",
  "frontend/src/config/adminGate.ts": "Defines the local‑only admin username gate and related storage key.",
  "frontend/src/game/activities/activities.ts": "Defines activity data including trust effects and optional unlockable moments.",
  "frontend/src/game/audio/useAudio.ts": "Zustand-powered audio manager that loads, controls, and plays looping background music.",
  "frontend/src/game/characters/Puro.tsx": "3D Puro character model with idle animation and click-to-open dialogue interaction.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Touch-based joystick, look controls, and jump button overlay for mobile devices.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard and joystick input into unified movement/look state and jump handling.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store for raw input values including joystick, look deltas, and jump requests.",
  "frontend/src/game/customization/customizationData.ts": "List of customizable environment items with allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Dialogue tree containing nodes, choices, trust effects, and branching paths.",
  "frontend/src/game/GameView.tsx": "Main game view component that initializes game state, mounts the 3D scene, plays music, and renders all UI overlays and menus.",
  "frontend/src/game/letters/letterTemplates.ts": "Provides keyword-based letter response generation using categorized template arrays.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a book-sorting mini-game where players drag books into categories and affect trust.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Displays a slideshow of Puro's drawings, granting trust as each is viewed.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "Runs a timed hide-and-seek game with randomized hiding spots and trust changes based on performance.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Provides a menu interface to launch various mini-games and handles their completion and closing.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Renders a scene viewer for story moments, showing the title, scene text, and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data entries with titles, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Implements the 3D library scene with movement, jumping physics, camera control, and lighting.",
  "frontend/src/game/state/useGameStore.ts": "Defines a persisted Zustand game store managing trust, dialogue, activities, letters, customization, endings, and UI visibility with related actions.",
  "frontend/src/game/story/endings.ts": "Defines ending data and provides a function to select an ending based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the ending scene based on trust level, unlocks the ending, and allows starting a new game or returning to the title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Renders a menu of activities that adjust trust, mark completion, unlock moments, and close after selection.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Allows placing discovered items in the library and displays both placed and available customization items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Handles dialogue progression with trust-based choices and updates the current dialogue node or closes the panel.",
  "frontend/src/game/ui/LettersPanel.tsx": "Lets players write letters, auto-generates responses, and shows an inbox of sent letters and replies.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of story moments, showing locked or unlocked states and allowing playback of unlocked moments.",
  "frontend/src/game/ui/PauseMenu.tsx": "Renders the pause menu with resume, quick-access navigation, settings, reset, and admin terminal options.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Provides audio settings with mute and volume controls and a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows the player's trust level using a labeled progress bar with color indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health status with React Query and provides a helper for one-off availability checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading via context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for backend game operations like fetching game state, making choices, and updating progress.",
  "frontend/src/index.css": "Defines Tailwind layers and a custom color/typography theme for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/startup.ts": "Handles one‑time startup logic including storage checks and asset preloading.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store for a simple username‑based local admin gate with persistence.",
  "frontend/src/state/useServerAccessStore.ts": "Empty placeholder file for future server‑access state logic.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for entering or locking the local admin gate username with feedback messages.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays the game’s credits, description, and a return button with a themed background.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin‑only diagnostic terminal overlay enabling command input, scrolling output, and keyboard toggle.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Shows user‑friendly and detailed error info when game launch fails, with retry and navigation options.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "A React error boundary that catches game runtime errors and displays a UI with optional technical details and a return-to-title button.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Displays a colored status indicator showing backend server health based on availability state.",
  "frontend/src/ui/terminal/commands.ts": "Implements a simple command parser for the in‑game terminal, supporting help, clear, diagnostics, and server status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into readable text lines for terminal display.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal state, output lines, input logging, and open/close behavior.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the game’s title screen with buttons, server status, admin tools, and offline notices depending on backend availability.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into categorized, user‑friendly summaries while preserving original error text.",
  "frontend/STARTUP.md": "Explains the startup module, initialization steps, and how App.tsx invokes the startup sequence.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Contains project version, a high-level description of the game, extensive architectural notes about backend dependencies and admin controls, and a list of known issues including deployment errors and conflicting requirements. Used as the master record of project state and technical constraints."
}