{
  "backend/main.mo": "Defines all backend game types and state, initializes dialogue, activities, moments, and provides entry points for starting or continuing a game.",
  "feature_evidence.json": "Lists features, associated files, components, and tests for reliability, error boundaries, asset handling, and diagnostics.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across UI, game systems, scenes, controls, and data.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables, theming, and global styles for light and dark modes.",
  "frontend/index.html": "Minimal HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling startup, navigation, backend game launches, error states, and diagnostics.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of activities with trust effects and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Zustand-powered audio manager handling volume, mute state, and background music playback with persistence.",
  "frontend/src/game/characters/Puro.tsx": "3D Puro character model with idle animation, hover effects, and click-to-open-dialogue interaction.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Touch-based joystick and look controls for mobile devices, updating player movement and camera look.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard, joystick, and look input into normalized movement and look vectors, respecting pause state.",
  "frontend/src/game/customization/customizationData.ts": "List of customizable items with descriptions and valid placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Dialogue tree defining nodes, choices, trust effects, and optional trust requirements.",
  "frontend/src/game/GameView.tsx": "Main game container that initializes the game, renders the 3D scene, HUD, menus, and handles pause state and background music.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates letter responses based on keyword matching using friendly, curious, or encouraging templates.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "A drag-and-drop style minigame where players sort shuffled books into categories, adjusting trust based on correctness.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A slideshow-style drawing viewer where players look through Puro's drawings, gaining trust as they view each one.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed guessing minigame where players try to find Puro's hiding spot, with trust changes based on speed and accuracy.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "A launcher component that shows a menu and loads one of several minigames based on player selection.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with title, scene text, and a close button in a modal-style card.",
  "frontend/src/game/moments/momentsData.ts": "Defines the Moment interface and exports a list of narrative moments with trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Renders the 3D library environment, handling player movement, camera control, textures, and scene objects.",
  "frontend/src/game/state/useGameStore.ts": "Zustand store managing trust, dialogue, activities, customization, letters, endings, and UI panel visibility with persistent state and actions.",
  "frontend/src/game/story/endings.ts": "Defines ending data and selects an ending based on trust level thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the final ending scene based on trust level, unlocks the ending, and provides options to start a new game or return to title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Shows selectable activities that modify trust, mark completion, unlock moments, and close the menu.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Allows placing discovered customization items in the library and displays placed and available items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Renders dialogue nodes with choices that adjust trust and navigate the dialogue tree.",
  "frontend/src/game/ui/LettersPanel.tsx": "Supports writing letters, auto-generating responses, and viewing inbox messages.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of unlockable story moments and lets the user play unlocked ones via MomentPlayer.",
  "frontend/src/game/ui/PauseMenu.tsx": "Provides a pause overlay with resume, navigation shortcuts, settings access, and progress reset options.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Renders audio settings including mute and volume controls with a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows the current trust level with a label, color indicator, and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider with login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with react-query hooks for game state, actions, and progress updates.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm-themed light/dark color palette.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/startup.ts": "Runs one‑time app startup, checking storage availability and preloading key images, with reset support for testing.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays the game's credits and about info with a themed background and a button to return to the title screen.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Shows user‑friendly and optional technical details when the game fails to launch, with a button to return to the title.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches runtime rendering errors and presents a recovery screen with optional stack details.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the main title menu with New Game, Continue, Settings, and Credits options, supporting a launching state.",
  "frontend/STARTUP.md": "Documentation of the frontend startup flow including asset preloading, storage checks, and runStartup API usage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, plugins, and content paths for the frontend.",
  "project_state.json": "Tracks project metadata, requirements, architecture notes, issues, and implemented features for the game."
}