{
  "backend/main.mo": "Motoko canister defining game state, dialogue, activities, moments, and player save data with functions for availability checks, starting games, and continuing sessions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and tests with high-level change metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend React, game logic, and UI files.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide for diagnosing and retrying failed Internet Computer deployments.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, themes, and base styling for the app.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading the main script.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operations guide explaining how to keep the backend canister running and troubleshoot availability issues.",
  "frontend/src/App.tsx": "Main React component managing screens, startup, backend availability checks, game launching, and diagnostics state.",
  "frontend/src/config/adminGate.ts": "Defines simple local admin gate username and storage key used to unlock admin features.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of activities with trust effects and optional moment unlocks.",
  "frontend/src/game/audio/useAudio.ts": "Zustand-based audio manager that handles volume, mute state, and background music playback using an HTMLAudioElement.",
  "frontend/src/game/characters/Puro.tsx": "3D Puro character component with idle animation, hover highlighting, and click-triggered dialogue opening.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Touch-device overlay providing joystick, look controls, and jump handling, disabled during pause or terminal use.",
  "frontend/src/game/controls/usePlayerControls.ts": "Combines keyboard, joystick, and look inputs into movement state and exposes methods for updating controls and triggering jumps.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store for player input state including joystick, look deltas, and one-shot jump requests with a consume mechanism.",
  "frontend/src/game/customization/customizationData.ts": "Defines customization items and their allowed placement locations for the customization system.",
  "frontend/src/game/dialogue/dialogueData.ts": "Static dialogue tree defining nodes, choices, trust effects, and branching dialogue logic.",
  "frontend/src/game/GameView.tsx": "Main game container that initializes state, sets up the 3D canvas, plays music, and conditionally renders UI panels and pause controls.",
  "frontend/src/game/letters/letterTemplates.ts": "Defines categorized response templates and selects one based on keywords in the player's letter.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Implements a drag-and-drop style book sorting game that adjusts trust based on correct or incorrect placements.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Shows a gallery of Puro’s drawings, tracking viewed items and adjusting trust as the player browses.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide‑and‑seek guessing game where finding Puro affects trust and ends the round.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Provides a menu for launching mini‑games and handles switching between them.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Renders a narrative moment with a title, scene text, and close action.",
  "frontend/src/game/moments/momentsData.ts": "Stores an array of narrative moment definitions including titles, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Defines the 3D library environment with player movement, jumping, camera control, and lighting.",
  "frontend/src/game/state/useGameStore.ts": "Defines a persistent Zustand store managing trust, dialogue, activities, customization, letters, endings, and UI visibility with related actions.",
  "frontend/src/game/story/endings.ts": "Defines ending data with trust thresholds and selects an ending based on trust level.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the ending scene based on trust level, records unlocked endings, and provides options to restart or return to title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Renders a menu of activities that modify trust, mark completion, unlock moments, and close the panel.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Allows placing discovered customization items in the library and shows placed and available items.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Handles dialogue progression, trust‑based choice filtering, and closing or advancing dialogue nodes.",
  "frontend/src/game/ui/LettersPanel.tsx": "Lets players write letters, receive generated responses, and view inbox messages.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a menu of story moments, allowing playback of unlocked ones and showing locked ones as obscured.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause menu providing resume, navigation shortcuts, settings, reset options, and an admin-only terminal entry.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Provides audio settings including mute toggle and volume slider with a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows trust level with color-coded label and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health via actor.isAvailable and exposes status, timestamps, errors, and refetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, clear, and identity context handling.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend game operations with React Query hooks for loading and mutating game state.",
  "frontend/src/index.css": "Defines Tailwind layers and sets light/dark theme CSS variables and base typography.",
  "frontend/src/main.tsx": "Initializes React app with react-query and Internet Identity provider.",
  "frontend/src/startup.ts": "Handles one‑time app startup, asset preloading, storage checks, and exposes reset utilities.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store for a local admin unlock gate with persistent isUnlocked state.",
  "frontend/src/state/useServerAccessStore.ts": "Empty placeholder store file.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for local admin unlock form with feedback and lock/unlock controls.",
  "frontend/src/ui/CreditsScreen.tsx": "Credits/about screen with game description, feature list, and return button.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Admin‑gated diagnostic terminal overlay supporting command input and output display.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays user‑friendly and detailed game launch errors with retry and back options.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches game runtime errors and displays a UI with optional technical details and a return-to-title button.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Displays a colored server status badge based on backend availability state.",
  "frontend/src/ui/terminal/commands.ts": "Implements a small terminal command system supporting help, clear, diagnostics, and server status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats internal diagnostic data into readable terminal output lines.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal visibility and output history with helper methods to append and clear lines.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the game's title screen with server status, admin tools, and buttons for starting, continuing, or configuring the game.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into categorized user‑friendly summaries with preserved raw text.",
  "frontend/STARTUP.md": "Documentation of the frontend startup sequence, initialization tasks, and extension guidelines.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended theme colors, typography, animations, and plugins.",
  "project_state.json": "JSON metadata describing the project’s narrative premise, architecture notes, known issues, and existing features for a 3D visual-novel adventure game. It tracks versioning and outlines backend, admin-mode, and UI/state requirements."
}