{
  "backend/main.mo": "Motoko canister defining dialogue, activities, moments, letters, and per‑user game state with functions to start or continue a game.",
  "feature_evidence.json": "Feature evidence report mapping specific frontend files to React initialization fixes and stability requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of all major frontend game files for planning.",
  "frontend/index.css": "Tailwind-based global stylesheet defining CSS variables for light and dark themes.",
  "frontend/index.html": "Static HTML entry point loading the root React application.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide explaining canister uptime limits and steps to keep the backend running.",
  "frontend/src/App.tsx": "Main React app handling startup, backend availability checks, navigation, and guarded game launch logic.",
  "frontend/src/game/activities/activities.ts": "Defines activity data including IDs, descriptions, trust effects, and optional unlockable moments.",
  "frontend/src/game/audio/useAudio.ts": "Manages audio settings and background music playback using a persisted Zustand store.",
  "frontend/src/game/characters/Puro.tsx": "3D Puro character component with idle animation, hover effects, and dialogue-triggering interactions.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Implements touch-based joystick and look controls for mobile devices.",
  "frontend/src/game/controls/usePlayerControls.ts": "Handles keyboard and joystick inputs, producing normalized movement and look deltas.",
  "frontend/src/game/customization/customizationData.ts": "Provides customization item definitions with allowed placement locations.",
  "frontend/src/game/dialogue/dialogueData.ts": "Contains structured dialogue tree nodes with choices, trust effects, and branching logic.",
  "frontend/src/game/GameView.tsx": "Main game view component that initializes the game, manages UI panels, audio, and 3D scene rendering.",
  "frontend/src/game/letters/letterTemplates.ts": "Generates letter responses by matching content keywords to friendly, curious, or encouraging templates.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "A book-sorting drag-and-drop minigame where correct placements adjust trust and completion triggers rewards.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "A drawing-viewing minigame where players browse Puro's sketches, increasing trust as they view each one.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "A timed hide-and-seek minigame where players guess Puro's hiding spot and gain or lose trust based on accuracy.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Launcher component that displays a menu and loads one of several minigames based on user selection.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with title and scene text inside a modal-like card.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment data objects containing titles, descriptions, scenes, and trust requirements.",
  "frontend/src/game/scene/LibraryScene.tsx": "Three.js library scene with player movement, camera follow, environment lighting, and interactive objects like bookshelves and Puro.",
  "frontend/src/game/state/useGameStore.ts": "Defines a persisted Zustand store holding game state, UI flags, and actions for trust, dialogue, activities, letters, customization, and endings.",
  "frontend/src/game/story/endings.ts": "Defines ending data and provides a helper to select an ending based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the final ending scene based on trust level and allows restarting or returning to the title screen.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Shows available activities, applies trust changes, records completion, unlocks moments, and closes after selection.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Lets players place discovered customization items in the library and view placed decorations.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Renders dialogue nodes with selectable choices that adjust trust and navigate or exit the dialogue tree.",
  "frontend/src/game/ui/LettersPanel.tsx": "Supports writing letters, receiving generated responses, and browsing the inbox.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Displays a list of moments, showing locked/unlocked status, and plays a selected moment via MomentPlayer.",
  "frontend/src/game/ui/PauseMenu.tsx": "Provides pause menu controls including resume, navigation to submenus, settings access, and progress reset.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Renders audio settings with mute toggle, volume slider, and a back button.",
  "frontend/src/game/ui/TrustMeter.tsx": "Shows the user's trust level with dynamic color, label, and progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Checks backend health status using the actor’s isAvailable method and exposes availability state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for game state fetching and mutations like choices, activities, customization, and progress reset.",
  "frontend/src/index.css": "Applies Tailwind base styles and defines a warm color palette with light and dark theme variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider before rendering App.",
  "frontend/src/startup.ts": "Runs one-time startup checks including storage availability and preloading assets, with reset support for testing.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays game credits and features with a themed background and a back button.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Shows a detailed launch error summary with optional technical details and retry/back actions.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "Catches runtime rendering errors in the game and displays a fallback UI with optional error details.",
  "frontend/src/ui/TitleScreen.tsx": "Renders the game's title menu with new game, continue, settings, credits, and server-status handling.",
  "frontend/src/utils/launchErrorNormalization.ts": "Converts raw launch errors into categorized, user-friendly summaries while preserving technical details.",
  "frontend/STARTUP.md": "Documentation of the frontend startup module and its one‑time initialization sequence.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Defines overall project state for a 3D library-based adventure/visual-novel hybrid, including gameplay goals, architecture notes, known issues, and existing feature requirements. Highlights startup/canister problems, render-loop bug, and unresolved visual-style scope decisions."
}