{
  "backend/main.mo": "Main Motoko actor defining game state, dialogue data, activities, moments, letters, and authorization, including transfur tracking fields and default state initialization.",
  "backend/migration.mo": "Migration module converting old game states to a new format by adding transfur-related fields while preserving existing data.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and tests for implementation tracking.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend source files used for build or documentation tooling.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide outlining steps to diagnose and retry failed Internet Computer deployments.",
  "frontend/index.css": "Tailwind CSS configuration defining light and dark theme variables and base styling rules.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the main frontend script.",
  "frontend/OPS_CANISTER_AVAILABILITY.md": "Operational guide for maintaining canister availability and addressing server offline issues.",
  "frontend/src/App.tsx": "Main React component managing startup, navigation, backend availability, game launch logic, and diagnostics.",
  "frontend/src/config/adminGate.ts": "Defines simple local admin gate settings, specifying the admin username and derived storage key.",
  "frontend/src/game/activities/activities.ts": "Defines the Activity interface and a list of activities that affect trust and may unlock moments.",
  "frontend/src/game/audio/useAudio.ts": "Provides a Zustand-based audio manager that stores volume/mute settings and controls background music playback.",
  "frontend/src/game/characters/Puro.tsx": "Renders the 3D Puro character with idle animation and handles interaction events to trigger dialogue.",
  "frontend/src/game/controls/MobileControlsOverlay.tsx": "Implements touch-based movement, look, and jump controls for mobile devices with joystick and look area handling.",
  "frontend/src/game/controls/usePlayerControls.ts": "Handles player movement and look input from keyboard and mobile controls, merging them into normalized movement output.",
  "frontend/src/game/controls/usePlayerControlsStore.ts": "Zustand store that tracks joystick, look deltas, and jump requests for player control input.",
  "frontend/src/game/customization/customizationData.ts": "Defines customization items and their allowed locations for arranging objects in the environment.",
  "frontend/src/game/dialogue/dialogueData.ts": "Contains dialogue nodes and choices forming a branching conversation tree with trust effects and optional requirements.",
  "frontend/src/game/enemies/types.ts": "Defines enemy state structure and shared constants for movement, detection, and visuals.",
  "frontend/src/game/enemies/WhiteLatexBeast.tsx": "Implements an enemy that wanders, chases the player, and triggers capture based on distance using Three.js and game constants.",
  "frontend/src/game/GameView.tsx": "Main game view component that initializes state, renders the 3D scene, overlays HUD/UI panels, handles pause logic, and starts background music.",
  "frontend/src/game/letters/letterTemplates.ts": "Provides sets of canned responses and selects one based on keywords in the player's letter.",
  "frontend/src/game/minigames/BookSortingMiniGame.tsx": "Interactive book-sorting minigame where correct sorting increases trust and completion triggers rewards.",
  "frontend/src/game/minigames/DrawingMiniGame.tsx": "Lets players view Puro's drawings, tracking viewed items and adjusting trust accordingly.",
  "frontend/src/game/minigames/HideAndSeekMiniGame.tsx": "Hide-and-seek minigame with timed guessing, trust adjustments, and randomized hiding spots.",
  "frontend/src/game/minigames/MiniGameLauncher.tsx": "Menu component that launches different minigames and handles closing and completion.",
  "frontend/src/game/moments/MomentPlayer.tsx": "Displays a narrative moment with title, scene text, and a close button.",
  "frontend/src/game/moments/momentsData.ts": "Defines moment metadata and scenes with trust requirements.",
  "frontend/src/game/scene/HiveScene.tsx": "Renders the hive scene with player movement, jump physics, procedural trees, enemy encounters, and transfur event handling.",
  "frontend/src/game/scene/LibraryScene.tsx": "Implements the library scene with movement, jump physics, camera control, texture loading, and proximity-based teleport triggering with Puro.",
  "frontend/src/game/state/useGameStore.ts": "Defines the global game state using Zustand, including trust, scenes, UI visibility, transfur logic, progress tracking, and related actions.",
  "frontend/src/game/state/useSettingsStore.ts": "Stores and persists player settings such as aim sensitivity using Zustand.",
  "frontend/src/game/story/endings.ts": "Contains ending definitions and selects the correct ending based on trust thresholds.",
  "frontend/src/game/story/EndingScene.tsx": "Displays the final ending scene based on trust level and allows starting a new game or returning to the title.",
  "frontend/src/game/ui/ActivityMenu.tsx": "Shows available activities, applies trust changes, completes activities, unlocks moments, and closes the menu.",
  "frontend/src/game/ui/CustomizationPanel.tsx": "Manages library customization by placing discovered items and showing placed or available decorations.",
  "frontend/src/game/ui/DialoguePanel.tsx": "Dialogue UI that shows the current dialogue node, filters choices by trust level, and updates trust and navigation between nodes.",
  "frontend/src/game/ui/LettersPanel.tsx": "Panel for writing letters, sending them with validation, and viewing letter history with auto‑generated responses.",
  "frontend/src/game/ui/MomentsMenu.tsx": "Menu listing unlockable moments and allowing playback of unlocked moments using the MomentPlayer component.",
  "frontend/src/game/ui/PauseMenu.tsx": "Pause menu providing resume, navigation to submenus, settings, reset, and optional admin terminal access.",
  "frontend/src/game/ui/SettingsScreen.tsx": "Settings screen for adjusting audio volume, mute state, and aim sensitivity with a back button.",
  "frontend/src/game/ui/TransfurOverlay.tsx": "Timed fade‑in/out overlay showing a transfur message and calling onComplete after animation.",
  "frontend/src/game/ui/TrustMeter.tsx": "Displays trust level with label, color indicator, and progress bar based on current trust value.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor tied to user identity and invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBackendAvailability.ts": "Hook checking backend availability via actor.isAvailable(), exposing status and refetch plus a standalone check helper.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend game actions like fetching game state and performing mutations such as choices and activities.",
  "frontend/src/index.css": "Tailwind CSS base theme defining color variables, dark mode values, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/startup.ts": "Implements one‑time startup logic including storage checks, asset preloading, and state reset for testing.",
  "frontend/src/state/useAdminGateStore.ts": "Zustand store providing a simple username‑based local admin unlock gate with persistence.",
  "frontend/src/state/useServerAccessStore.ts": "Empty placeholder file for future server access state logic.",
  "frontend/src/ui/AdminAccessPanel.tsx": "UI panel for entering the admin username to unlock or lock admin mode with feedback messages.",
  "frontend/src/ui/CreditsScreen.tsx": "Displays game credits, about info, and a back button with a themed background.",
  "frontend/src/ui/DiagnosticTerminalOverlay.tsx": "Renders an admin diagnostic terminal overlay with input handling, auto-scroll, command execution, and keyboard shortcuts.",
  "frontend/src/ui/GameLaunchErrorScreen.tsx": "Displays a user-facing game launch error screen with retry options and expandable technical diagnostics.",
  "frontend/src/ui/GameRuntimeErrorBoundary.tsx": "React error boundary that catches runtime errors during gameplay and shows an error card with optional stack details.",
  "frontend/src/ui/ServerStatusIndicator.tsx": "Shows a small UI indicator reflecting backend server health status using colored icons and text.",
  "frontend/src/ui/terminal/commands.ts": "Implements a limited terminal command parser handling help, clear, diagnostics, and backend server status checks.",
  "frontend/src/ui/terminal/useTerminalDiagnostics.ts": "Formats diagnostic data into readable text lines for terminal display.",
  "frontend/src/ui/terminal/useTerminalStore.ts": "Zustand store managing terminal state, input/output lines, and utility actions like open, close, and clear.",
  "frontend/src/ui/TitleScreen.tsx": "Main title screen UI with game start options, server status indicators, admin tools, and offline mode alerts.",
  "frontend/src/utils/launchErrorNormalization.ts": "Normalizes raw launch errors into user-friendly messages with categorized error types.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/STARTUP.md": "Documentation describing the app startup workflow, initialization tasks, and how to extend the startup process.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and plugins.",
  "project_state.json": "JSON snapshot of project state, features, and metadata for tracking development progress."
}