{
  "kind": "build_request",
  "title": "Fix React 'Maximum update depth exceeded' infinite update loop during gameplay mount",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Eliminate the React runtime error \"Maximum update depth exceeded\" that occurs during gameplay initialization by fixing any render/update loops triggered by state updates inside effects or lifecycle-equivalent logic (e.g., repeated store resets, unstable effect dependencies).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Error is... Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops."
        ]
      },
      "acceptanceCriteria": [
        "Starting a New Game transitions from the Title screen to gameplay without throwing \"Maximum update depth exceeded\" in the browser console.",
        "Continuing a game transitions from the Title screen to gameplay without throwing \"Maximum update depth exceeded\" in the browser console.",
        "Gameplay remains interactive (HUD renders, mobile controls overlay renders) after mount."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Make gameplay initialization in `frontend/src/game/GameView.tsx` resilient to React re-renders and Strict Mode double-invocation by ensuring `initializeGame(isNewGame)` is not repeatedly invoked in a way that causes continuous state updates. Add a guard so initialization runs only when appropriate (e.g., once per mount and/or only when `isNewGame` changes meaningfully).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Maximum update depth exceeded. This can happen when a component repeatedly calls setState..."
        ]
      },
      "acceptanceCriteria": [
        "`initializeGame(true)` does not repeatedly reset the Zustand store in a way that causes a re-render loop.",
        "Toggling unrelated UI state (e.g., opening/closing pause menu) does not cause game re-initialization.",
        "No infinite loop occurs even if React Strict Mode causes effects to run more than once in development."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Stabilize effect dependencies involved in gameplay mount to prevent re-running initialization due to unstable function identities (e.g., `playBackgroundMusic` from `frontend/src/game/audio/useAudio.ts`). Ensure any functions used in `GameView` effects are memoized or invoked from effects that cannot repeatedly trigger store updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Maximum update depth exceeded... repeatedly calls setState..."
        ]
      },
      "acceptanceCriteria": [
        "`GameView` does not re-run its initialization effect solely because a function dependency identity changes between renders.",
        "Background music playback attempt still occurs on gameplay start, but does not contribute to any repeated state updates or render loops.",
        "No new user-facing error text is introduced as part of this fix (keep user-facing text in English if any is added)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (read-only UI component sources).",
    "Do not edit immutable hook files: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Keep the existing single-page app navigation flow in `frontend/src/App.tsx` (Title → Game → error screens) intact while fixing the update loop."
  ],
  "nonGoals": [
    "Adding new gameplay features, content, or UI redesign unrelated to fixing the update-depth error.",
    "Changing backend Motoko APIs or save schema for this issue.",
    "Implementing new third-party monitoring/logging services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}