{
  "kind": "build_request",
  "title": "Bug fixes and Puro visual redesign (non-3D look)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Scan the project for runtime errors, React warnings, and obvious logic bugs; fix or remove the buggy code paths without changing intended gameplay behavior.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Check for bugs and if there are bugs then delete them."
        ]
      },
      "acceptanceCriteria": [
        "App builds successfully with TypeScript with no new compile errors introduced.",
        "No React console warnings are introduced by the changes.",
        "Gameplay still launches and both Library and Hive scenes render and are playable after fixes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the invalid React Hooks usage in the Library scene texture loading so that hooks are not conditionally/imperatively invoked (remove the current try/catch hook invocation pattern) while preserving the fallback behavior if the wood texture cannot be used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Check for bugs and if there are bugs then delete them."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/game/scene/LibraryScene.tsx` no longer disables `react-hooks/rules-of-hooks` for texture loading.",
        "The Library floor still renders with the wood texture when available, and still renders with a non-textured fallback material when it is not available.",
        "No runtime crash occurs during Library scene mount due to texture loading failures."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix performance/logic bugs caused by updating React state inside the render loop (`useFrame`) for movement/jump/camera logic in `LibraryScene.tsx` and `HiveScene.tsx` by moving per-frame physics state (e.g., vertical velocity, grounded state, player world position) to refs or other non-re-rendering storage, while keeping the same movement feel and collision behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Check for bugs and if there are bugs then delete them."
        ]
      },
      "acceptanceCriteria": [
        "Library and Hive scenes no longer call React `setState` on every animation frame for physics state updates.",
        "Jumping, gravity, and ground collision still function correctly in both scenes.",
        "Enemy AI in the Hive still receives up-to-date player position for chasing/capture logic."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the Puro character rendering to visually resemble Puro from DragonSnow’s Changed (stylized, game-accurate look) while keeping it in the current 3D scene pipeline; implement a clearly non-3D look (e.g., billboard/sprite or flat toon/cel style) instead of the current simple 3D capsule/sphere model.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also, Make puro look like he is from the real changed game by dragonsnow changed except 3d"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/game/characters/Puro.tsx` no longer renders Puro as the current basic capsule/sphere/cone body parts.",
        "Puro appears as a flat/stylized non-3D character in the scene (e.g., sprite/billboard or toon-flat mesh) while remaining positioned and interactable as before.",
        "Clicking Puro still triggers dialogue (`setShowDialogue(true)`), and hover still provides clear feedback (cursor change and a visible hover effect)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add the required Puro visual assets as static files under `frontend/public/assets/generated/` and load them directly from the frontend (do not route images through the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make puro look like he is from the real changed game by dragonsnow changed except 3d"
        ]
      },
      "acceptanceCriteria": [
        "New Puro image assets exist in `frontend/public/assets/generated/` with the exact filenames specified in this build request.",
        "Puro rendering uses these static assets in-game without requiring backend calls.",
        "The app continues to run in offline mode with Puro assets loading correctly from the bundled frontend."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional backend services.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui`; compose instead of modifying read-only UI components.",
    "Place any generated/added images in `frontend/public/assets/generated/` and reference them from the frontend."
  ],
  "nonGoals": [
    "Do not add new chase systems, new enemies, or new scenes beyond what already exists.",
    "Do not implement third-party authentication providers (only Internet Identity is supported).",
    "Do not add external databases or non-Motoko backend code."
  ],
  "imageRequirements": {
    "required": [
      "Stylized black latex wolf humanoid character sprite, front-facing, neutral/idle pose, high-contrast cartoon shading, transparent background (puro-idle-front.dim_512x512.png)",
      "Stylized black latex wolf humanoid character sprite, slight 3/4 view, neutral/idle pose, high-contrast cartoon shading, transparent background (puro-idle-34.dim_512x512.png)",
      "Stylized black latex wolf humanoid character sprite, hover/highlight variant (slightly brighter rim light), transparent background (puro-hover.dim_512x512.png)"
    ],
    "edits": []
  }
}