{
  "kind": "build_request",
  "title": "Handle IC0508 'canister is stopped' errors during New Game/Continue with retries and user-friendly messaging",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Detect Internet Computer replica rejection errors where the reject_message contains \"is stopped\" (e.g., IC0508 / reject_code 5) for backend calls used to start gameplay (startNewGame, continueGame), and convert them into a user-friendly, English error summary that clearly indicates the game server is temporarily offline/stopped and the user should try again later.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Error: ... reject_message\": \"Canister pmng3-byaaa-aaaag-awtia-cai is stopped\" ... Method name: startNewGame ... error_code\": \"IC0508\", \"reject_code\": 5"
        ]
      },
      "acceptanceCriteria": [
        "When startNewGame fails with an IC0508/reject_code 5 \"Canister ... is stopped\" rejection, the launch error screen shows a clear English summary such as \"The game server is temporarily offline (canister is stopped). Please try again in a moment.\" (wording may vary but must be clear and non-technical).",
        "The technical details view still preserves the underlying error string (including reject code/message and canister id) so the full context can be copied if needed.",
        "The same handling applies to continueGame failures with the same stopped-canister signature."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Add a retry path on the launch error screen that allows the user to retry the last failed launch action (New Game or Continue) without requiring a full page refresh, and ensure the UI reflects retry-in-progress state and prevents double-submission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Action: New Game",
          "Stage: failed",
          "Game Mounted: No"
        ]
      },
      "acceptanceCriteria": [
        "On the \"Unable to Start Game\" screen, a primary action \"Retry\" is available when lastLaunchAction is present.",
        "Clicking \"Retry\" re-attempts the same action (startNewGame or continueGame) and shows a loading/disabled state until completion.",
        "If the retry succeeds, the app transitions to gameplay as normal and diagnostics reflect a successful launch (launchStage complete, gameMounted true).",
        "If the retry fails again, the user remains on the error screen with the updated user-friendly summary and updated technical details."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Implement a small, centralized frontend error-normalization utility for backend actor call failures used during launch so that App diagnostics and GameLaunchErrorScreen can present consistent summaries (e.g., distinguish \"no saved game\" vs \"canister stopped\" vs generic connectivity errors), without losing the original raw error message for technical details.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The replica returned a rejection error: ... reject_code: 5 ... \"Canister pmng3-byaaa-aaaag-awtia-cai is stopped\""
        ]
      },
      "acceptanceCriteria": [
        "Launch failures produce consistent, human-readable summaries in English across both New Game and Continue.",
        "The raw error message is still stored and displayed in the technical details section exactly (or functionally) as today.",
        "Existing \"No saved game found\" messaging remains intact for the continue flow when applicable and is not replaced by the generic messaging."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui (compose them instead).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Preventing a canister from being stopped at the IC/relica level (operational/deployment concern) is out of scope for code changes here.",
    "Adding new authentication providers or external monitoring/alerting integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}