{
  "kind": "build_request",
  "title": "Improve backend canister availability so the game server stays online",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Add a lightweight backend availability endpoint that the frontend can call to confirm the game canister is running before attempting launch actions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make the game server always online"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo exposes a non-throwing availability method (e.g., a query health/status call) that returns successfully when the canister is running",
        "Calling the availability method does not require any existing saved game state and does not trap under normal conditions"
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add a frontend preflight check that verifies backend availability on the Title screen and immediately before invoking New Game / Continue, and present clear English UI when the server is offline/stopped.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make the game server always online"
        ]
      },
      "acceptanceCriteria": [
        "When the user opens the app (Title screen), the frontend performs a backend availability check and records the result in state used by the launch UI",
        "When backend availability check indicates failure (including canister stopped-like failures), the Title screen disables or warns on New Game / Continue with English text indicating the game server is offline and to try again later",
        "When backend availability later becomes healthy, the Title screen reflects the healthy state without requiring a full page refresh (e.g., via retry / periodic recheck)"
      ]
    },
    {
      "id": "REQ-27",
      "text": "Add a small, developer-facing operations document that explains how to keep the Internet Computer game canister online in production (e.g., ensure it is started and funded with cycles) and clarifies the platform limitation that a stopped canister cannot be programmatically restarted by the canister itself.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make the game server always online"
        ]
      },
      "acceptanceCriteria": [
        "A new documentation file is added that includes explicit English guidance for keeping the canister running (started, funded) and what to check when users see 'server offline/stopped' errors",
        "The document explicitly states that the app cannot guarantee 100% uptime purely through frontend/backend code and that starting/stopping is an operational/controller responsibility"
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only create backend/migration.mo if an upgrade requires state migration (conditional migration policy).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Guaranteeing absolute 'always online' uptime in all circumstances (e.g., controller-stopped canister, network-wide outages).",
    "Implementing third-party uptime monitoring services, external cron jobs, or WebSocket-based real-time connectivity.",
    "Adding new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}