{
  "kind": "build_request",
  "title": "Trigger the existing secret event when the player touches Puro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-67",
      "text": "Detect when the player character avatar touches/collides with Puro in the 3D library scene and trigger the existing \"secret\" event that was recently added.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5",
          "recent-messages-9"
        ],
        "quotes": [
          "Make if your character touches puro then the secret that you recently added happens",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "When the player avatar moves into contact range with Puro (e.g., within a small collision radius), the same secret event/sequence currently used elsewhere is triggered.",
        "The secret event triggers from touch/collision without requiring a click on Puro.",
        "The touch trigger works on both desktop (keyboard movement) and mobile (joystick movement)."
      ]
    },
    {
      "id": "REQ-68",
      "text": "Add a cooldown/one-shot guard so the touch-triggered secret event does not repeatedly fire every frame while the player remains in contact with Puro.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Make if your character touches puro then the secret that you recently added happens"
        ]
      },
      "acceptanceCriteria": [
        "While the player remains overlapping/touching Puro, the secret event does not continuously re-trigger.",
        "After the player separates and re-approaches (or after a short cooldown), the touch trigger can fire again in a controlled way.",
        "The guard does not break Puro’s existing click-to-open-dialogue interaction."
      ]
    },
    {
      "id": "REQ-69",
      "text": "Ensure the touch interaction remains benign and consistent with the existing no-transfurring rule (no harm or transformation on contact). Any user-facing text used by the secret event/touch feedback must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-5"
        ],
        "quotes": [
          "Make if your character touches puro then the secret that you recently added happens"
        ]
      },
      "acceptanceCriteria": [
        "Touching Puro does not apply any harmful effects or transformation mechanics.",
        "Any new on-screen/toast text added specifically for the touch trigger is English-only."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths)."
  ],
  "nonGoals": [
    "Do not add new endings, new dialogue branches, or new mini-games as part of this change.",
    "Do not implement physics-engine-based collisions; a simple proximity/collision-radius check is sufficient unless already present.",
    "Do not change backend Motoko logic unless the existing secret event is backend-driven and cannot be triggered from the frontend without it."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}