{
  "kind": "build_request",
  "title": "Add a UI switch to enable/disable backend server access (local toggle)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "Add an in-app on/off switch that toggles whether the app is allowed to call the backend canister (local “server access” toggle), and persist this preference across page reloads.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make a switch to turn the server on/off"
        ]
      },
      "acceptanceCriteria": [
        "A user can toggle a clearly labeled on/off control to enable or disable backend server access.",
        "The toggle state persists across reloads (e.g., via local storage or an existing persisted store pattern).",
        "When server access is OFF, the app does not perform backend availability polling (useBackendAvailability) and does not attempt backend calls for New Game / Continue.",
        "All user-facing text describing this toggle is in English and does not claim it starts/stops the Internet Computer canister itself."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Integrate the server access toggle into the Title Screen so that when server access is disabled, New Game and Continue are disabled and the user is shown a clear English explanation that backend calls are disabled locally.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make a switch to turn the server on/off"
        ]
      },
      "acceptanceCriteria": [
        "Title Screen shows a visible status when server access is OFF (e.g., “Server access is disabled in this app”).",
        "New Game and Continue buttons are disabled when server access is OFF, regardless of backend health.",
        "If server access is OFF, the existing “Server Offline” alert UI is not shown as a result of polling (because polling is disabled); instead, the UI communicates the local disabled state.",
        "No changes are required to immutable paths under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Extend the Diagnostic Terminal command set to support toggling the local server access switch (diagnostic-only), and update terminal help text accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make a switch to turn the server on/off"
        ]
      },
      "acceptanceCriteria": [
        "Terminal supports commands to set server access ON and OFF (exact command names are up to implementation but must be documented in the terminal 'help' output).",
        "Terminal output clearly states this is a local app toggle and does not start/stop/restart the canister.",
        "When server access is OFF, 'server status' (availability check) returns a clear English message indicating checks are disabled because server access is OFF."
      ]
    }
  ],
  "constraints": [
    "Do not implement any functionality that claims to start/stop/restart the backend canister from within the app; the toggle must be a local control over whether the frontend makes backend calls.",
    "Respect the single-actor backend architecture; no backend changes are required for this request.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding real operational canister start/stop/restart controls (these require controller access and are out of scope).",
    "Adding third-party admin auth or privileged control panels.",
    "Changing backend availability semantics; backend/main.mo isAvailable remains a simple health check."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}