{
  "kind": "build_request",
  "title": "Change local admin username gate to \"ADMIN\"",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-47",
      "text": "Update the local-only admin username gate so that admin mode unlocks only when the entered username exactly matches \"ADMIN\" (case-sensitive), replacing the current configured admin username.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Make the admin username \"ADMIN\""
        ]
      },
      "acceptanceCriteria": [
        "Admin mode unlock succeeds when the user enters exactly \"ADMIN\".",
        "Admin mode unlock fails for \"admin\", \"Admin\", \"ADMIN \" (trailing space), or any other non-exact value.",
        "All existing admin-only UI remains gated by the updated admin unlock condition."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Ensure that changing the configured admin username invalidates any previously persisted \"admin unlocked\" state so that users who were unlocked under the old username are not still unlocked after the change.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Make the admin username \"ADMIN\""
        ]
      },
      "acceptanceCriteria": [
        "After updating the admin username to \"ADMIN\", a user who was previously in an unlocked admin state is no longer unlocked on page reload until they enter \"ADMIN\" again.",
        "Locking admin mode still clears the local persisted admin-unlocked state."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only UI components).",
    "Keep the admin gate local-only (no Internet Identity changes required for this request)."
  ],
  "nonGoals": [
    "Do not add new admin features or expand the terminal command set.",
    "Do not implement secure authentication/authorization beyond the existing local-only username gate."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}