{
  "kind": "build_request",
  "title": "Change mobile look controls to right-side screen drag",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the mobile look/aim control so the player looks around by dragging on the right side of the screen (a large right-side touch area), rather than only inside the small circular \"Look\" widget.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make looking around dragging around the right side of the screen."
        ]
      },
      "acceptanceCriteria": [
        "On touch devices, dragging a finger on the right side of the screen produces continuous camera rotation (yaw/pitch) using the existing look delta pipeline (usePlayerControls -> usePlayerControlsStore -> scene camera rotation).",
        "The look drag area covers the right portion of the screen (e.g., right half), not just the small 32x32 circle.",
        "The left joystick area remains dedicated to movement input and is not impacted by the new look area.",
        "The look control is disabled while the game is paused or the diagnostic terminal is open (consistent with existing isDisabled behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the right-side look drag area correctly initializes and resets drag state on touch start/end so the first movement after touching down results in smooth look deltas (no requirement to \"move once\" before it starts responding).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make looking around dragging around the right side of the screen."
        ]
      },
      "acceptanceCriteria": [
        "Starting a new drag on the right-side look area immediately begins tracking deltas from the initial touch point.",
        "Lifting the finger ends the look drag and resets any stored last-touch state so a subsequent drag does not jump.",
        "Releasing touch sets look delta back to neutral (no continued camera drift after the drag ends)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all backend logic in the single Motoko actor (no backend changes expected for this request)."
  ],
  "nonGoals": [
    "Changing keyboard/mouse look behavior for desktop users (unless required incidentally by the right-side drag implementation).",
    "Adding new gameplay features (combat, enemies, new scenes, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}