{
  "kind": "build_request",
  "title": "Add player character movement and on-screen jump button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-49",
      "text": "Render a visible player character avatar in the 3D library scene and make it move with the existing movement inputs (keyboard WASD/arrow keys on desktop and the on-screen joystick on touch devices).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the character able to move. Add a jump button too..."
        ]
      },
      "acceptanceCriteria": [
        "When gameplay starts, a visible player avatar (e.g., a simple capsule/mesh) is present in the scene at the player position.",
        "Using WASD/arrow keys moves the player avatar around the library on desktop.",
        "Using the mobile joystick moves the player avatar around the library on touch devices.",
        "Movement is disabled while the game is paused and while the diagnostic terminal is open (consistent with current input handling).",
        "Player position remains constrained within the existing library bounds so the avatar cannot leave the playable area."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Implement a jump action for the player character, including basic gravity and ground collision so the player returns to the floor after jumping.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the character able to move. Add a jump button too..."
        ]
      },
      "acceptanceCriteria": [
        "Pressing the desktop jump key (Space) triggers a jump when the player is on the ground.",
        "The player cannot initiate another jump while already in the air (no double-jump) unless explicitly reset by landing.",
        "Jumping uses a consistent arc (upward impulse + gravity) and lands back at the floor height without sinking below it.",
        "Jump input is ignored while paused or while the diagnostic terminal is open.",
        "No runtime errors occur in the render loop while jumping repeatedly."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Add a dedicated on-screen Jump button to the mobile controls overlay that triggers the same jump action as the desktop Space key, with English label text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make the character able to move. Add a jump button too..."
        ]
      },
      "acceptanceCriteria": [
        "On touch devices, a clearly visible button labeled \"Jump\" appears in the gameplay HUD alongside the existing mobile controls.",
        "Tapping the \"Jump\" button causes the player to jump (same behavior as Space).",
        "The Jump button does not interfere with joystick movement or look controls (touch interactions remain usable).",
        "The Jump button respects pause/terminal state (cannot jump while paused or terminal open).",
        "All user-facing text on the button is English (\"Jump\")."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep backend as single-actor Motoko; no backend changes are required for movement/jump.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Adding combat, enemies, health, stamina, or advanced physics/collision beyond basic ground-and-gravity jumping.",
    "Adding multiplayer or real-time synchronization.",
    "Changing story/dialogue/trust systems as part of this movement/jump work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}