{
  "kind": "build_request",
  "title": "Add ambush-triggered chase that continuously tracks the player and ends on escape distance",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the WhiteLatexBeast enemy AI to include an \"ambush\" phase that triggers before chasing: when the enemy decides to engage the player, it must play an ambush animation/state and then transition into chase immediately after the ambush animation ends.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make the white latexes start chasing the player after ambushing them",
          "Immediately"
        ]
      },
      "acceptanceCriteria": [
        "When an enemy first engages the player (per the existing engage logic in WhiteLatexBeast), it enters an ambush state before chase.",
        "After the ambush state/animation completes, the chase begins immediately (no added delay).",
        "Capture logic (ENEMY_CONSTANTS.CAPTURE_RADIUS) continues to function and can still trigger during chase as it does today."
      ]
    },
    {
      "id": "REQ-2",
      "text": "During the chase phase, make WhiteLatexBeast continuously track the player's current position each frame (i.e., chase direction updates in real time based on the player's latest position).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "They continuously track the player's location"
        ]
      },
      "acceptanceCriteria": [
        "While chasing, the enemy's movement direction updates continuously using the latest provided playerPosition (not a single stored target position).",
        "Enemy rotation/facing while chasing continues to align with the current direction toward the player."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Change chase termination so that once the enemy has begun chasing (after ambush), it continues chasing until the player escapes beyond a configured escape distance, at which point the enemy stops chasing and returns to wandering behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And to end the chase make the player have to escape some distance"
        ]
      },
      "acceptanceCriteria": [
        "After chase has started, the enemy does not stop chasing merely because the player exits the original aggro radius; it only stops when the player exceeds the configured escape distance.",
        "Once the player exceeds the escape distance, the enemy transitions out of chase and resumes the existing wander behavior."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add/adjust enemy tuning constants in frontend/src/game/enemies/types.ts to support ambush + escape-based chase (e.g., an ambush duration and an escape radius/distance), and ensure the HiveScene behavior remains stable with multiple enemies and while transfur encounter UI is active (disabled enemies must not progress ambush/chase timers or move).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "Enemy constants include values necessary to configure the ambush phase and escape distance without hardcoding magic numbers inside WhiteLatexBeast.tsx.",
        "When HiveScene sets disabled={isInTransfurEncounter}, WhiteLatexBeast does not move or advance its AI state until re-enabled.",
        "No backend changes are required for this behavior."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose instead of modifying).",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add multiplayer, real-time networking, or WebSocket-based synchronization.",
    "Do not change the transfur overlay messaging/content beyond what is necessary for the chase/ambush mechanics.",
    "Do not add new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}