{
  "kind": "build_request",
  "title": "Teleport to generated 3D White Latex Forest (“the hive”) when touching Puro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new 3D scene representing “the hive”: a generated 3D “white latex forest” environment inspired by the *Changed* (DragonSnow) white latex forest, using only original/procedurally generated geometry/materials (no copyrighted assets).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The hive is the white latex forest",
          "Make a 3d version",
          "generate it",
          "The white latex forest is from changed by dragonsnow"
        ]
      },
      "acceptanceCriteria": [
        "A new React Three Fiber scene component exists for the white latex forest environment (the hive).",
        "The hive scene renders without requiring external model downloads or third-party assets.",
        "Visuals communicate a white/latex-like forest through lighting, palette, and materials while remaining clearly original (not a ripped recreation)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement player teleport-on-touch with Puro: when the player avatar collides/enters proximity with the existing Puro 3D model, transition gameplay from the library scene to the hive (white latex forest) scene and place the player at a defined spawn point in the hive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it teleport you to the hive if you touch puro",
          "A 3d model that you added",
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "Touching/entering the existing Puro proximity radius triggers a scene change to the hive.",
        "Teleport trigger uses a one-shot + cooldown/hysteresis guard so it does not repeatedly fire every frame while in contact.",
        "After teleport, the camera and player controls continue to function normally in the hive scene."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the current “touch Puro unlocks admin mode” proximity secret in `frontend/src/game/scene/LibraryScene.tsx` with the new teleport-to-hive behavior (so touching Puro teleports instead of unlocking admin mode). Any user-facing feedback text related to teleport must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it teleport you to the hive if you touch puro",
          "Build it"
        ]
      },
      "acceptanceCriteria": [
        "In the library scene, Puro proximity no longer calls `attemptUnlock('ADMIN')` as its primary effect.",
        "If a toast/overlay is shown for teleport, its text is English-only.",
        "Clicking Puro still opens dialogue as before (teleport is specifically on touch/proximity, not on click)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything inside `frontend/src/components/ui` (compose them instead).",
    "Keep all backend logic in the existing single Motoko actor (`backend/main.mo`) if any backend changes are later required; do not introduce additional backend services.",
    "User-facing text introduced by this change must be in English."
  ],
  "nonGoals": [
    "Do not implement or integrate external 3D models/maps from *Changed* or any copyrighted asset extraction.",
    "Do not add multiplayer, real-time networking, chat, or web sockets.",
    "Do not add third-party authentication beyond Internet Identity.",
    "Do not redesign unrelated UI panels/mini-games beyond what is necessary to support the new hive scene and teleport transition."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}