{
  "kind": "build_request",
  "title": "Fix app not starting when clicking Start/New Game (startup + game launch reliability)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Ensure the game reliably transitions from the Title screen to gameplay when the user clicks the start action (\"New Game\" and \"Continue\"), and prevent silent failures that leave the app appearing to not start.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It is not starting when I click the startup"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"New Game\" on the title screen always navigates to the gameplay view (3D canvas visible) or shows a clear, user-facing error screen if gameplay initialization fails.",
        "Clicking \"Continue\" navigates to gameplay using existing saved state (or shows a clear message if continuing is not possible due to missing/corrupt saved data).",
        "If gameplay fails to mount for any reason, the user is presented with an on-screen error state (not a blank screen) that includes a \"Back to Title\" action."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add a top-level runtime error boundary around the gameplay rendering path (including the React Three Fiber Canvas / scene) so that runtime exceptions (e.g., texture loading failures, WebGL issues) are caught and surfaced to the user with English error text and a recovery option.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It is not starting when I click the startup"
        ]
      },
      "acceptanceCriteria": [
        "A runtime error occurring during GameView/Canvas/scene rendering does not crash the entire app or result in a blank screen.",
        "When an error is caught, a fallback UI is shown with: (1) a short plain-English message, (2) an optional expandable technical detail section, and (3) a \"Back to Title\" button that returns to the title screen.",
        "The fallback UI is styled consistently with the existing Tailwind theme and remains readable on mobile."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Harden the asset startup and in-game asset loading flow so missing static assets do not prevent the game from starting (e.g., generated textures or audio files). Where assets are required for rendering, provide safe fallbacks instead of throwing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It is not starting when I click the startup"
        ]
      },
      "acceptanceCriteria": [
        "Startup preloading failures never block the app from becoming interactive (title screen still renders, and navigation still works).",
        "If a required 3D texture fails to load at runtime, the scene renders with a fallback material (e.g., a solid color) instead of throwing and blocking gameplay.",
        "If background music fails to play/load (including autoplay restrictions), gameplay still starts and the app remains responsive; the app does not show a blocking error modal for audio issues."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add lightweight startup + navigation diagnostics in the UI to help identify why startup/game launch failed (without requiring devtools), including a clear indicator of whether startup initialization completed and whether the game view mounted successfully.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It is not starting when I click the startup"
        ]
      },
      "acceptanceCriteria": [
        "When startup fails or gameplay fails to mount, the user can see a concise English message describing the stage that failed (e.g., \"Startup initialization failed\" vs \"Game view failed to load\").",
        "Diagnostics messaging does not appear during a normal successful flow (or is only visible in the error/fallback UI).",
        "No sensitive information (keys, identities, principals) is shown in user-facing diagnostics."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only and must be composed).",
    "Do not edit immutable hook entrypoints listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Adding new gameplay features, scenes, activities, or dialogue content.",
    "Changing the authentication flow (Internet Identity).",
    "Backend canister schema changes or migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}