{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "WhiteLatexBeast ambush-to-chase AI with continuous tracking and escape-distance termination",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an ambush phase that plays immediately when the enemy first engages, then transitions directly into chase when ambush completes.",
      "acceptanceCriteria": [
        "When an enemy first engages the player (per the existing engage logic in WhiteLatexBeast), it enters an ambush state before chase.",
        "After the ambush state/animation completes, the chase begins immediately (no added delay).",
        "Capture logic (ENEMY_CONSTANTS.CAPTURE_RADIUS) continues to function and can still trigger during chase as it does today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/enemies/WhiteLatexBeast.tsx",
          "operation": "modify",
          "description": "Refactor WhiteLatexBeast AI into explicit phases (e.g., wander/ambush/chase) so that on first engagement (transition into aggro) the enemy enters an ambush state, plays an ambush animation/state for a configured duration, and then transitions immediately into chase when that ambush completes. Ensure capture checks still run and can trigger during chase."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure chase continuously updates direction and facing toward the player’s latest position every frame.",
      "acceptanceCriteria": [
        "While chasing, the enemy's movement direction updates continuously using the latest provided playerPosition (not a single stored target position).",
        "Enemy rotation/facing while chasing continues to align with the current direction toward the player."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/enemies/WhiteLatexBeast.tsx",
          "operation": "modify",
          "description": "During the chase phase, compute chase direction each frame from the current enemy position to the latest playerPosition, and use that direction for both movement and rotation/facing so tracking remains real-time."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Change chase termination to persist until the player exceeds a configured escape distance, then return to wandering.",
      "acceptanceCriteria": [
        "After chase has started, the enemy does not stop chasing merely because the player exits the original aggro radius; it only stops when the player exceeds the configured escape distance.",
        "Once the player exceeds the escape distance, the enemy transitions out of chase and resumes the existing wander behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/enemies/WhiteLatexBeast.tsx",
          "operation": "modify",
          "description": "Update chase state machine so that once chase begins (after ambush), it continues regardless of AGGRO_RADIUS and only terminates when distanceToPlayer exceeds a configured escape distance; on termination, reset to the existing wander behavior (including wander direction timing)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add tuning constants for ambush and escape-distance chase, and ensure disabled enemies do not move or advance timers/state while transfur UI is active.",
      "acceptanceCriteria": [
        "Enemy constants include values necessary to configure the ambush phase and escape distance without hardcoding magic numbers inside WhiteLatexBeast.tsx.",
        "When HiveScene sets disabled={isInTransfurEncounter}, WhiteLatexBeast does not move or advance its AI state until re-enabled.",
        "No backend changes are required for this behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/enemies/types.ts",
          "operation": "modify",
          "description": "Add/adjust ENEMY_CONSTANTS to include ambush and escape-based chase tuning (e.g., AMBUSH_DURATION, ESCAPE_DISTANCE/ESCAPE_RADIUS) so WhiteLatexBeast can reference them without hardcoded numbers."
        },
        {
          "path": "frontend/src/game/enemies/WhiteLatexBeast.tsx",
          "operation": "modify",
          "description": "Ensure all AI state progression (ambush timers, chase persistence checks, wander timers) and all movement/rotation updates are fully paused when disabled is true (early return before any timer/state changes), preserving stable behavior with multiple enemies and while the transfur encounter UI is active."
        }
      ]
    }
  ]
}