{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile right-side screen-drag look controls",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the small mobile Look widget with a large right-side touch drag area that drives the existing look delta pipeline without affecting the left movement joystick, and respects pause/terminal disable rules.",
      "acceptanceCriteria": [
        "On touch devices, dragging a finger on the right side of the screen produces continuous camera rotation (yaw/pitch) using the existing look delta pipeline (usePlayerControls -> usePlayerControlsStore -> scene camera rotation).",
        "The look drag area covers the right portion of the screen (e.g., right half), not just the small 32x32 circle.",
        "The left joystick area remains dedicated to movement input and is not impacted by the new look area.",
        "The look control is disabled while the game is paused or the diagnostic terminal is open (consistent with existing isDisabled behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/controls/MobileControlsOverlay.tsx",
          "operation": "modify",
          "description": "Expand the look input surface from the current small circular Look element into a large right-side screen touch area (e.g., right half of the viewport) that captures drag movement and calls updateLook with scaled deltas. Ensure the left joystick remains on the left and continues to receive its own touch interactions without interference (including layering/pointer-events so the right-side look area does not block the joystick). Also ensure look drag handling is gated by the existing isDisabled (paused/terminal open) behavior and resets look deltas to neutral when disabled."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix right-side look drag initialization/reset so each new touch drag starts smoothly from the initial touch point, ends cleanly, and never leaves residual look drift.",
      "acceptanceCriteria": [
        "Starting a new drag on the right-side look area immediately begins tracking deltas from the initial touch point.",
        "Lifting the finger ends the look drag and resets any stored last-touch state so a subsequent drag does not jump.",
        "Releasing touch sets look delta back to neutral (no continued camera drift after the drag ends)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/controls/MobileControlsOverlay.tsx",
          "operation": "modify",
          "description": "Update the look drag state machine to initialize on touchstart (store initial touch position and the active touch identifier), compute deltas on touchmove relative to the last stored position, and fully reset on touchend/touchcancel (clear last-touch state and active identifier, call updateLook(0, 0)). Ensure a new drag always starts from its own initial touch point (no 'move once' requirement) and that multi-touch (e.g., joystick + look) does not cause the look handler to read the wrong touch."
        }
      ]
    }
  ]
}