{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Trigger existing secret event on player proximity to Puro (3D scene)",
  "requirements": [
    {
      "id": "REQ-67",
      "summary": "Add a proximity (collision-radius) check between the player avatar and Puro in the 3D library scene and invoke the existing secret event without requiring clicks, for both keyboard and mobile joystick movement.",
      "acceptanceCriteria": [
        "When the player avatar moves into contact range with Puro (e.g., within a small collision radius), the same secret event/sequence currently used elsewhere is triggered.",
        "The secret event triggers from touch/collision without requiring a click on Puro.",
        "The touch trigger works on both desktop (keyboard movement) and mobile (joystick movement)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Implement a lightweight per-frame proximity check between playerRef and Puro (using a small collision radius) and, when entering contact range, call the existing secret-event trigger used elsewhere in the app (route it through a shared function/store action rather than duplicating logic)."
        },
        {
          "path": "frontend/src/game/state/useGameStore.ts",
          "operation": "modify",
          "description": "Add (or expose) a single store-level action that triggers the existing secret event/sequence so it can be invoked from the 3D proximity logic while reusing the exact same secret behavior already implemented elsewhere."
        },
        {
          "path": "frontend/src/game/characters/Puro.tsx",
          "operation": "modify",
          "description": "Ensure Puro remains compatible with proximity detection by making its world position reliably accessible to LibraryScene (e.g., via an optional ref/prop or by keeping the authoritative Puro position available to the scene) while preserving the current click-to-open-dialogue interaction."
        }
      ]
    },
    {
      "id": "REQ-68",
      "summary": "Prevent the touch-triggered secret event from firing repeatedly every frame while the player remains overlapping Puro, without breaking Puro’s click interaction.",
      "acceptanceCriteria": [
        "While the player remains overlapping/touching Puro, the secret event does not continuously re-trigger.",
        "After the player separates and re-approaches (or after a short cooldown), the touch trigger can fire again in a controlled way.",
        "The guard does not break Puro’s existing click-to-open-dialogue interaction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Add a one-shot / cooldown guard for the proximity trigger (e.g., track overlap state and last-trigger time with refs, trigger only on entering the radius, and reset when the player exits beyond a small hysteresis margin) so the secret event does not re-fire every frame."
        },
        {
          "path": "frontend/src/game/characters/Puro.tsx",
          "operation": "modify",
          "description": "Confirm the existing click interaction throttle remains intact and independent from the proximity guard (no shared timing state that could block normal click-to-open-dialogue)."
        }
      ]
    },
    {
      "id": "REQ-69",
      "summary": "Keep touch interaction harmless (no transfurring/transform effects) and ensure any new touch-trigger feedback text is English-only.",
      "acceptanceCriteria": [
        "Touching Puro does not apply any harmful effects or transformation mechanics.",
        "Any new on-screen/toast text added specifically for the touch trigger is English-only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Ensure the proximity-triggered secret invocation does not apply any additional contact effects (no damage, no transformation, no trust penalties/forced state changes) beyond what the existing secret event already does; if any optional feedback is added for touch activation, keep it English-only."
        },
        {
          "path": "frontend/src/game/state/useGameStore.ts",
          "operation": "modify",
          "description": "Review the shared secret-event trigger action to ensure it remains benign on contact and does not introduce any harm/transformation mechanics; ensure any newly introduced user-facing strings related specifically to the touch trigger are English-only."
        }
      ]
    }
  ]
}