{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Bug fixes + non-3D Puro sprite redesign",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix runtime errors, React warnings, and obvious logic bugs without changing intended gameplay behavior.",
      "acceptanceCriteria": [
        "App builds successfully with TypeScript with no new compile errors introduced.",
        "No React console warnings are introduced by the changes.",
        "Gameplay still launches and both Library and Hive scenes render and are playable after fixes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/enemies/WhiteLatexBeast.tsx",
          "operation": "modify",
          "description": "Remove unused React imports/state patterns that can trigger React warnings and unnecessary re-renders (e.g., eliminate unused imports like useEffect) while keeping enemy visuals and AI behavior unchanged."
        },
        {
          "path": "frontend/src/game/characters/Puro.tsx",
          "operation": "modify",
          "description": "Harden pointer/cursor handling to avoid leaving the cursor in an incorrect state after hover/unmount, and ensure interaction handlers remain stable (click triggers dialogue, hover feedback works) after the redesign."
        },
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Address obvious scene-level runtime/logic issues discovered during the fixes (e.g., remove per-frame state updates and unsafe texture loading patterns) while keeping movement feel, collisions, and teleport behavior intact."
        },
        {
          "path": "frontend/src/game/scene/HiveScene.tsx",
          "operation": "modify",
          "description": "Address obvious scene-level runtime/logic issues discovered during the fixes (e.g., remove per-frame state updates and improve how enemy AI receives player position) while keeping movement feel, collisions, and encounter behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix invalid React Hooks usage in LibraryScene texture loading while preserving fallback material behavior.",
      "acceptanceCriteria": [
        "`frontend/src/game/scene/LibraryScene.tsx` no longer disables `react-hooks/rules-of-hooks` for texture loading.",
        "The Library floor still renders with the wood texture when available, and still renders with a non-textured fallback material when it is not available.",
        "No runtime crash occurs during Library scene mount due to texture loading failures."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Replace the current try/catch + conditional hook invocation pattern for `useTexture` with a hook-safe approach: load the wood texture without violating Hooks rules (e.g., via a non-hook TextureLoader in an effect and a ref/state that does not require conditional hook calls), and keep the same fallback floor material when the texture is unavailable."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Eliminate per-frame React state updates in useFrame for movement/jump/camera logic by moving physics state to refs, preserving gameplay feel and AI behavior.",
      "acceptanceCriteria": [
        "Library and Hive scenes no longer call React `setState` on every animation frame for physics state updates.",
        "Jumping, gravity, and ground collision still function correctly in both scenes.",
        "Enemy AI in the Hive still receives up-to-date player position for chasing/capture logic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Move per-frame physics state (e.g., vertical velocity, grounded state) from React state to refs (or other non-re-rendering storage) and update movement/jump/camera logic to use those refs so no React state setters are called every frame."
        },
        {
          "path": "frontend/src/game/scene/HiveScene.tsx",
          "operation": "modify",
          "description": "Move per-frame physics state (vertical velocity, grounded state, and player world position) out of React state into refs; update useFrame logic accordingly and ensure encounter pause/cooldowns still work without re-render loops."
        },
        {
          "path": "frontend/src/game/enemies/WhiteLatexBeast.tsx",
          "operation": "modify",
          "description": "Update how the enemy reads the player's position so it can receive up-to-date coordinates without relying on the parent scene re-rendering every frame (e.g., accept a ref or getter for the player's world position) while preserving the existing chase/ambush/wander behavior and capture timing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Redesign Puro to a stylized, clearly non-3D look (sprite/billboard or flat toon) while keeping current interaction and scene placement.",
      "acceptanceCriteria": [
        "`frontend/src/game/characters/Puro.tsx` no longer renders Puro as the current basic capsule/sphere/cone body parts.",
        "Puro appears as a flat/stylized non-3D character in the scene (e.g., sprite/billboard or toon-flat mesh) while remaining positioned and interactable as before.",
        "Clicking Puro still triggers dialogue (`setShowDialogue(true)`), and hover still provides clear feedback (cursor change and a visible hover effect)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/characters/Puro.tsx",
          "operation": "modify",
          "description": "Replace the current 3D primitive-based body parts with a non-3D rendering approach (billboard/sprite or flat plane that faces the camera) using the generated Puro PNG assets; preserve the existing ref-based placement, idle bob animation, click-to-open dialogue, and hover feedback (cursor + visible highlight)."
        },
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Verify the updated Puro rendering remains positioned and interactable in the Library scene (including proximity detection/teleport behavior) after switching to the non-3D sprite/billboard representation."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add required Puro visual assets under frontend/public/assets/generated and load them as static frontend files.",
      "acceptanceCriteria": [
        "New Puro image assets exist in `frontend/public/assets/generated/` with the exact filenames specified in this build request.",
        "Puro rendering uses these static assets in-game without requiring backend calls.",
        "The app continues to run in offline mode with Puro assets loading correctly from the bundled frontend."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/puro-idle-front.dim_512x512.png",
          "operation": "create",
          "description": "Add the required static Puro sprite asset (transparent background) at the exact path: frontend/public/assets/generated/puro-idle-front.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/puro-idle-34.dim_512x512.png",
          "operation": "create",
          "description": "Add the required static Puro sprite asset (transparent background) at the exact path: frontend/public/assets/generated/puro-idle-34.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/puro-hover.dim_512x512.png",
          "operation": "create",
          "description": "Add the required static Puro hover/highlight sprite asset (transparent background) at the exact path: frontend/public/assets/generated/puro-hover.dim_512x512.png."
        },
        {
          "path": "frontend/src/game/characters/Puro.tsx",
          "operation": "modify",
          "description": "Load and use the new static Puro assets directly from the frontend bundle (no backend calls), referencing these exact files: frontend/public/assets/generated/puro-idle-front.dim_512x512.png, frontend/public/assets/generated/puro-idle-34.dim_512x512.png, and frontend/public/assets/generated/puro-hover.dim_512x512.png."
        }
      ]
    }
  ]
}