{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Teleport from Library to procedurally generated Hive (white latex forest) on Puro touch",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new React Three Fiber “hive” 3D scene with an original, procedurally generated white/latex-like forest environment.",
      "acceptanceCriteria": [
        "A new React Three Fiber scene component exists for the white latex forest environment (the hive).",
        "The hive scene renders without requiring external model downloads or third-party assets.",
        "Visuals communicate a white/latex-like forest through lighting, palette, and materials while remaining clearly original (not a ripped recreation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/scene/HiveScene.tsx",
          "operation": "create",
          "description": "Create a new 3D scene component that procedurally generates an original “white latex forest” look (e.g., instanced smooth trunks, glossy/physical materials, fog, and lighting), using only code-defined geometry/materials (no external models/assets)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement teleport-on-touch with Puro to transition from the library scene to the hive scene and spawn the player at a defined hive start position with a one-shot/cooldown guard.",
      "acceptanceCriteria": [
        "Touching/entering the existing Puro proximity radius triggers a scene change to the hive.",
        "Teleport trigger uses a one-shot + cooldown/hysteresis guard so it does not repeatedly fire every frame while in contact.",
        "After teleport, the camera and player controls continue to function normally in the hive scene."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/state/useGameStore.ts",
          "operation": "modify",
          "description": "Add persistent in-game scene state (e.g., currentScene: 'library'|'hive') and actions to request a teleport to hive while storing a defined hive spawn position so the next scene can place the player consistently."
        },
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Update the Puro proximity check to trigger a one-shot teleport action (with cooldown/hysteresis retained) that switches the current scene to 'hive' and records the hive spawn; keep collision radius behavior and ensure user-facing teleport feedback text (if shown) is English."
        },
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Wire scene switching so the Canvas renders LibraryScene or HiveScene based on the store’s currentScene; ensure HiveScene consumes the stored spawn position and initializes player/camera accordingly so controls continue to work after transition."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Replace the library scene’s Puro proximity admin-unlock secret with teleport-to-hive behavior while keeping Puro click dialogue unchanged and ensuring English-only feedback text.",
      "acceptanceCriteria": [
        "In the library scene, Puro proximity no longer calls `attemptUnlock('ADMIN')` as its primary effect.",
        "If a toast/overlay is shown for teleport, its text is English-only.",
        "Clicking Puro still opens dialogue as before (teleport is specifically on touch/proximity, not on click)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Remove/replace the existing proximity secret that unlocks admin mode (including `attemptUnlock('ADMIN')` and related toast) so proximity instead triggers teleport-to-hive; preserve Puro’s onClick behavior by not changing the Puro component’s click handler semantics."
        }
      ]
    }
  ]
}