{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update local admin gate username to ADMIN and invalidate old unlock state",
  "requirements": [
    {
      "id": "REQ-47",
      "summary": "Change the local-only admin username gate to unlock only on exact, case-sensitive match to \"ADMIN\".",
      "acceptanceCriteria": [
        "Admin mode unlock succeeds when the user enters exactly \"ADMIN\".",
        "Admin mode unlock fails for \"admin\", \"Admin\", \"ADMIN \" (trailing space), or any other non-exact value.",
        "All existing admin-only UI remains gated by the updated admin unlock condition."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/adminGate.ts",
          "operation": "modify",
          "description": "Update the configured ADMIN_USERNAME constant to \"ADMIN\" (case-sensitive exact match)."
        },
        {
          "path": "frontend/src/state/useAdminGateStore.ts",
          "operation": "modify",
          "description": "Ensure the unlock check continues to compare the raw entered value exactly against the configured ADMIN_USERNAME (no trimming/case normalization), so only exact \"ADMIN\" unlocks."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Invalidate any previously persisted admin-unlocked state when the configured admin username changes.",
      "acceptanceCriteria": [
        "After updating the admin username to \"ADMIN\", a user who was previously in an unlocked admin state is no longer unlocked on page reload until they enter \"ADMIN\" again.",
        "Locking admin mode still clears the local persisted admin-unlocked state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/adminGate.ts",
          "operation": "modify",
          "description": "Revise ADMIN_GATE_STORAGE_KEY to be derived from (or versioned with) the configured admin username so that changing the username results in a new persistence key and the old unlocked state is not reused."
        },
        {
          "path": "frontend/src/state/useAdminGateStore.ts",
          "operation": "modify",
          "description": "Wire the updated ADMIN_GATE_STORAGE_KEY into Zustand persist configuration and confirm the lock action keeps persisting the locked state (so admin lock reliably clears the persisted unlocked flag for the active key)."
        }
      ]
    }
  ]
}