{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend preflight backend availability check + ops documentation",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Add a Title screen backend availability preflight check (on load + before New Game/Continue) with clear offline UI and retry/polling.",
      "acceptanceCriteria": [
        "When the user opens the app (Title screen), the frontend performs a backend availability check and records the result in state used by the launch UI",
        "When backend availability check indicates failure (including canister stopped-like failures), the Title screen disables or warns on New Game / Continue with English text indicating the game server is offline and to try again later",
        "When backend availability later becomes healthy, the Title screen reflects the healthy state without requiring a full page refresh (e.g., via retry / periodic recheck)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendAvailability.ts",
          "operation": "create",
          "description": "Create a small hook that calls the backend actor's availability method (e.g., isAvailable) and normalizes results into UI-friendly states (checking/healthy/unhealthy + lastChecked + lastError), supporting manual retry and optional periodic recheck while on the Title screen."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate backend availability state into the Title screen flow: run an availability check when the Title screen is shown, recheck periodically or via explicit retry, and perform an immediate preflight availability check inside the New Game / Continue handlers before calling launch mutations; if unavailable, keep user on the Title screen and surface a clear English message instead of attempting launch."
        },
        {
          "path": "frontend/src/ui/TitleScreen.tsx",
          "operation": "modify",
          "description": "Update the Title screen UI to reflect backend availability status: show an English 'server offline/stopped' warning when unhealthy, disable or guard New Game/Continue accordingly, and provide a Retry action that triggers a recheck; use shadcn-ui components (e.g., Button/Card) for consistent styling. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Add a developer-facing operations document explaining how to keep the IC game canister online and the limitation that stopped canisters cannot self-restart.",
      "acceptanceCriteria": [
        "A new documentation file is added that includes explicit English guidance for keeping the canister running (started, funded) and what to check when users see 'server offline/stopped' errors",
        "The document explicitly states that the app cannot guarantee 100% uptime purely through frontend/backend code and that starting/stopping is an operational/controller responsibility"
      ],
      "file_operations": [
        {
          "path": "frontend/OPS_CANISTER_AVAILABILITY.md",
          "operation": "create",
          "description": "Add an operations guide describing how to keep the game canister online in production (ensure it is started and funded with cycles), common checks when users see 'server offline/stopped' messaging, and an explicit note that the app cannot guarantee 100% uptime because a stopped canister cannot be programmatically restarted by the canister/frontend; starting/stopping is an operational/controller responsibility."
        }
      ]
    }
  ]
}