{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Local server access toggle (persisted) with Title Screen + Diagnostic Terminal integration",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Add a persisted local in-app toggle that gates all backend-canister calls and disables backend availability polling when OFF.",
      "acceptanceCriteria": [
        "A user can toggle a clearly labeled on/off control to enable or disable backend server access.",
        "The toggle state persists across reloads (e.g., via local storage or an existing persisted store pattern).",
        "When server access is OFF, the app does not perform backend availability polling (useBackendAvailability) and does not attempt backend calls for New Game / Continue.",
        "All user-facing text describing this toggle is in English and does not claim it starts/stops the Internet Computer canister itself."
      ],
      "file_operations": [
        {
          "path": "frontend/src/state/useServerAccessStore.ts",
          "operation": "create",
          "description": "Create a small Zustand persisted store (using the existing persisted-store pattern in the app) that holds a boolean like `serverAccessEnabled` (default ON) and exposes actions to enable/disable/toggle it; persist via local storage so the preference survives reloads."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the persisted server-access state into the app’s backend interaction flow: (1) disable backend availability polling by passing `enabled: false` into useBackendAvailability when server access is OFF, and (2) add local guards in `handleNewGame` / `handleContinue` to prevent attempting any backend calls when server access is OFF (use only local messaging and avoid any wording implying the canister is being started/stopped)."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Expose the server access toggle on the Title Screen and reflect the local disabled state by disabling New Game/Continue and showing a clear English explanation instead of server-offline polling UI.",
      "acceptanceCriteria": [
        "Title Screen shows a visible status when server access is OFF (e.g., “Server access is disabled in this app”).",
        "New Game and Continue buttons are disabled when server access is OFF, regardless of backend health.",
        "If server access is OFF, the existing “Server Offline” alert UI is not shown as a result of polling (because polling is disabled); instead, the UI communicates the local disabled state.",
        "No changes are required to immutable paths under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
      ],
      "file_operations": [
        {
          "path": "frontend/src/ui/TitleScreen.tsx",
          "operation": "modify",
          "description": "Integrate a clearly labeled local 'Server access' ON/OFF control directly into the Title Screen UI; use existing shadcn-ui primitives already used here (e.g., Card/Alert/Button) for consistent styling (Verify the component's usage instructions before implementing). When OFF: show a visible English explanation that backend calls are disabled locally, disable New Game and Continue regardless of backend health, and suppress the existing 'Server Offline' alert behavior (treat local OFF as a distinct state)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Pass the server-access state into TitleScreen so it can render the local status/explanation and enforce button disabling independent of backend availability (ensure any backend availability state is not used to drive 'Server Offline' UI when server access is OFF)."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Add diagnostic terminal commands to turn local server access ON/OFF, update help text, and make 'server status' reflect that checks are disabled when server access is OFF.",
      "acceptanceCriteria": [
        "Terminal supports commands to set server access ON and OFF (exact command names are up to implementation but must be documented in the terminal 'help' output).",
        "Terminal output clearly states this is a local app toggle and does not start/stop/restart the canister.",
        "When server access is OFF, 'server status' (availability check) returns a clear English message indicating checks are disabled because server access is OFF."
      ],
      "file_operations": [
        {
          "path": "frontend/src/ui/terminal/commands.ts",
          "operation": "modify",
          "description": "Extend the command parser to support new commands that set the local server-access toggle ON/OFF (document the exact command names in the terminal help output). Update 'server status' so that when local server access is OFF it prints a clear English message that availability checks are disabled due to the local toggle, and it must not claim to start/stop/restart the canister."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the `checkServerStatus` function passed into the DiagnosticTerminalOverlay to respect the local server-access toggle (when OFF, return a disabled/checks-not-performed result so commands can report accurately without calling the backend)."
        },
        {
          "path": "frontend/src/ui/DiagnosticTerminalOverlay.tsx",
          "operation": "modify",
          "description": "Ensure the terminal overlay’s command execution context includes everything needed for the new server-access commands (if required by the chosen implementation approach), without adding any authentication flow."
        }
      ]
    }
  ]
}