{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable game launch with gameplay error recovery, asset fallbacks, and UI diagnostics",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Make TitleScreen \"New Game\" / \"Continue\" reliably transition into gameplay, with explicit user-facing failure states and recovery back to title.",
      "acceptanceCriteria": [
        "Clicking \"New Game\" on the title screen always navigates to the gameplay view (3D canvas visible) or shows a clear, user-facing error screen if gameplay initialization fails.",
        "Clicking \"Continue\" navigates to gameplay using existing saved state (or shows a clear message if continuing is not possible due to missing/corrupt saved data).",
        "If gameplay fails to mount for any reason, the user is presented with an on-screen error state (not a blank screen) that includes a \"Back to Title\" action."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden the Title -> Game transition by making New Game / Continue actions asynchronous and stateful: show a non-blocking launching state, invoke existing backend calls via React Query hooks (startNewGame / continueGame) before switching to gameplay, and route failures to a dedicated game-launch error UI that includes a Back to Title action. Also track and reset per-launch diagnostics state to prevent silent failures."
        },
        {
          "path": "frontend/src/ui/TitleScreen.tsx",
          "operation": "modify",
          "description": "Disable or visually indicate TitleScreen actions while a launch is in progress, and surface a concise Continue-not-possible message when the app detects missing/corrupt state. Use shadcn-ui Button/Card composition for consistent styling (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Add explicit \"mounted successfully\" signaling (e.g., via an onMounted callback and/or Canvas onCreated) so App can confirm the gameplay view is visible; on mount failure/timeouts, allow App to show a user-facing error state rather than a blank screen."
        },
        {
          "path": "frontend/src/ui/GameLaunchErrorScreen.tsx",
          "operation": "create",
          "description": "Create a dedicated, mobile-readable error screen shown when game launch/continue fails or when the game view fails to mount. Include: plain-English error summary, optional expandable technical details, and a \"Back to Title\" button. Compose with shadcn-ui Card/Button for theme consistency (verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add a top-level runtime error boundary around the gameplay rendering path (React Three Fiber Canvas/scene) to catch runtime exceptions and provide recovery UI.",
      "acceptanceCriteria": [
        "A runtime error occurring during GameView/Canvas/scene rendering does not crash the entire app or result in a blank screen.",
        "When an error is caught, a fallback UI is shown with: (1) a short plain-English message, (2) an optional expandable technical detail section, and (3) a \"Back to Title\" button that returns to the title screen.",
        "The fallback UI is styled consistently with the existing Tailwind theme and remains readable on mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/ui/GameRuntimeErrorBoundary.tsx",
          "operation": "create",
          "description": "Implement a React error boundary dedicated to the gameplay rendering subtree. It should capture errors from GameView/Canvas/scene rendering, store error details safely, and render a styled fallback UI with an optional technical details section and a Back to Title action. Compose fallback with shadcn-ui Card/Button to match existing theme (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the gameplay rendering path with the new GameRuntimeErrorBoundary so runtime exceptions in Canvas/scene do not blank the screen. Wire the boundary's \"Back to Title\" recovery to the existing title navigation."
        },
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Ensure GameView renders in a way that allows the error boundary to catch failures from Canvas/scene, and report mount success/failure stage to App for coordinated recovery UI."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Harden startup and in-game asset loading so missing textures/audio do not block the game; provide safe runtime fallbacks instead of throwing.",
      "acceptanceCriteria": [
        "Startup preloading failures never block the app from becoming interactive (title screen still renders, and navigation still works).",
        "If a required 3D texture fails to load at runtime, the scene renders with a fallback material (e.g., a solid color) instead of throwing and blocking gameplay.",
        "If background music fails to play/load (including autoplay restrictions), gameplay still starts and the app remains responsive; the app does not show a blocking error modal for audio issues."
      ],
      "file_operations": [
        {
          "path": "frontend/src/startup.ts",
          "operation": "modify",
          "description": "Keep startup idempotent and non-blocking, but improve resilience by capturing preload results (success/failure per asset) without throwing, returning a concise message suitable for user-facing warnings while still allowing the app to become interactive."
        },
        {
          "path": "frontend/src/game/scene/LibraryScene.tsx",
          "operation": "modify",
          "description": "Replace/augment the current texture loading approach with a safe, non-throwing load path that falls back to a basic/solid material when the texture at frontend/public/assets/generated/wood-paper-texture-tile.dim_512x512.png fails to load, preventing runtime exceptions from blocking scene rendering."
        },
        {
          "path": "frontend/src/game/audio/useAudio.ts",
          "operation": "modify",
          "description": "Harden audio initialization and playback: guard Audio construction, handle missing file load errors, and ensure playBackgroundMusic never throws and never blocks gameplay. Maintain silent/non-blocking behavior for autoplay restrictions while optionally reporting a non-sensitive diagnostic reason to the launch diagnostics system."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add lightweight UI diagnostics for startup/game launch stages (startup complete vs game view mounted) that appear only on error/fallback screens without exposing sensitive data.",
      "acceptanceCriteria": [
        "When startup fails or gameplay fails to mount, the user can see a concise English message describing the stage that failed (e.g., \"Startup initialization failed\" vs \"Game view failed to load\").",
        "Diagnostics messaging does not appear during a normal successful flow (or is only visible in the error/fallback UI).",
        "No sensitive information (keys, identities, principals) is shown in user-facing diagnostics."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Introduce a minimal diagnostics model in App (startup complete flag, last launch action, launch stage, game mounted flag, and sanitized error message). Ensure diagnostics are only rendered in error/fallback UIs and never include identities/principals or other sensitive values."
        },
        {
          "path": "frontend/src/ui/GameLaunchErrorScreen.tsx",
          "operation": "modify",
          "description": "Display concise stage-based diagnostics (e.g., \"Startup initialization failed\" vs \"Game view failed to load\" vs \"Continue failed\") and an optional expandable technical detail section that is sanitized and non-sensitive. Compose with shadcn-ui components for consistent styling (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/ui/GameRuntimeErrorBoundary.tsx",
          "operation": "modify",
          "description": "Augment the runtime error fallback UI to include stage-aware diagnostics (e.g., indicate that the game view mounted vs failed during rendering) and ensure technical details are optional/expandable and do not include sensitive information. Compose with shadcn-ui Card/Button (verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}