{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "White Latex Beast enemies + non-graphic transfur encounter with persisted outcome sync",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add glossy white \"White Latex Beast\" 3D enemies in the hive that patrol/wander and chase the player within an aggro radius.",
      "acceptanceCriteria": [
        "When the player enters the hive scene, at least one enemy is present/spawned and visible as a glossy white creature (not just a static prop).",
        "Enemies have continuous movement behavior: idle/patrol when far, chase when within a defined distance.",
        "Enemy movement updates every frame without causing major frame drops (no obvious stutter beyond existing scene performance)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/enemies/WhiteLatexBeast.tsx",
          "operation": "create",
          "description": "Create a reusable react-three-fiber enemy component that renders as a glossy white latex creature and implements lightweight per-frame AI (wander/patrol vs chase) based on distance to the player. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/enemies/types.ts",
          "operation": "create",
          "description": "Add shared enemy-related types/constants (e.g., aggro radius, capture radius, movement speeds) to keep tuning centralized and avoid duplicated magic numbers across scenes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/scene/HiveScene.tsx",
          "operation": "modify",
          "description": "Spawn and render one or more White Latex Beast enemies in the hive scene; wire player world position into the enemy AI and ensure enemies update movement every frame while respecting existing scene bounds/performance constraints. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Trigger a non-graphic transfur encounter on enemy contact that temporarily disables controls, shows an English message/screen effect, and respawns the player to a defined hive spawn position.",
      "acceptanceCriteria": [
        "When an enemy collides with (or gets within a small capture radius of) the player, a transformation encounter is triggered.",
        "During the encounter, player controls are temporarily disabled or effectively prevented from continuing normal movement until the encounter resolves.",
        "After the encounter resolves, the player is placed into a well-defined post-encounter state (e.g., respawned to hiveSpawnPosition) and a visible English message indicates what happened."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/state/useGameStore.ts",
          "operation": "modify",
          "description": "Add transfur encounter UI/runtime state (e.g., isInTransfurEncounter, lastTransfurMessage) and actions to start/resolve an encounter, including pausing gameplay, setting a clear English message, and setting hiveSpawnPosition for a deterministic respawn. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/ui/TransfurOverlay.tsx",
          "operation": "create",
          "description": "Create a small overlay UI (screen tint/flash + message) to clearly indicate a non-graphic transformation encounter in English while controls are disabled. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Render the TransfurOverlay above the Canvas when an encounter is active and ensure pause/controls disabling is applied consistently (leveraging existing isPaused behavior). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/scene/HiveScene.tsx",
          "operation": "modify",
          "description": "Detect enemy capture/collision with the player (distance-based capture radius) and trigger the transfur encounter flow; on resolution, respawn the player at hiveSpawnPosition and prevent immediate re-triggering via a short cooldown. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Sync persisted transfur outcome fields with the backend-pro տրամ  state (transfurred / timesTransfurred) during load/continue and record new encounters when online.",
      "acceptanceCriteria": [
        "Backend GameState includes new fields for transformation tracking (e.g., a boolean flag and/or a counter) and these values are returned by getGameState/continueGame.",
        "A new backend update method (or an extension of an existing one) allows the frontend to record a transformation encounter without trapping.",
        "Frontend updates the persisted local game store to reflect backend-provided transformation fields when continuing/loading.",
        "If the canister state schema changes, a conditional migration is added in backend/migration.mo so existing saves do not trap on upgrade."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/state/useGameStore.ts",
          "operation": "modify",
          "description": "Add persisted fields for transfurred and timesTransfurred and a hydration action that maps backend GameState into the local Zustand store (including bigint->number conversions where needed). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook to record a transfur encounter when online (wrapping the existing backend capability) and invalidate/refetch game state as appropriate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire backend GameState hydration into the existing new-game/continue flows by applying returned/queried state to the local game store (including transfur tracking fields), while keeping offline mode fully local. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/scene/HiveScene.tsx",
          "operation": "modify",
          "description": "On transfur encounter resolution, invoke the new recordTransfurred mutation when online (and update local state immediately for responsiveness), while ensuring offline mode still increments local tracking without backend calls. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}