{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix infinite React update loop on gameplay mount by guarding initialization and stabilizing effect dependencies",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Eliminate the gameplay-mount \"Maximum update depth exceeded\" error by removing render/update loops caused by repeated initialization state updates.",
      "acceptanceCriteria": [
        "Starting a New Game transitions from the Title screen to gameplay without throwing \"Maximum update depth exceeded\" in the browser console.",
        "Continuing a game transitions from the Title screen to gameplay without throwing \"Maximum update depth exceeded\" in the browser console.",
        "Gameplay remains interactive (HUD renders, mobile controls overlay renders) after mount."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Refactor gameplay mount logic to avoid any effect-triggered re-render loop: ensure game initialization and audio start are not invoked in a way that continuously updates state, and reduce unnecessary re-renders from broad Zustand subscriptions."
        },
        {
          "path": "frontend/src/game/audio/useAudio.ts",
          "operation": "modify",
          "description": "Stabilize the audio manager API (especially background music start) to prevent identity-driven effect re-runs that can cascade into repeated state updates."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Make `GameView` initialization resilient to re-renders and React Strict Mode by guarding `initializeGame(isNewGame)` so it only runs when appropriate.",
      "acceptanceCriteria": [
        "`initializeGame(true)` does not repeatedly reset the Zustand store in a way that causes a re-render loop.",
        "Toggling unrelated UI state (e.g., opening/closing pause menu) does not cause game re-initialization.",
        "No infinite loop occurs even if React Strict Mode causes effects to run more than once in development."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Add an explicit initialization guard (e.g., ref-based \"has initialized\" / \"last initialized mode\") so `initializeGame(isNewGame)` only runs once per mount and/or only when `isNewGame` meaningfully changes; also ensure the initialization effect is not coupled to unrelated UI state changes."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Stabilize gameplay-mount effect dependencies (e.g., audio functions) to prevent initialization re-running due to unstable function identities.",
      "acceptanceCriteria": [
        "`GameView` does not re-run its initialization effect solely because a function dependency identity changes between renders.",
        "Background music playback attempt still occurs on gameplay start, but does not contribute to any repeated state updates or render loops.",
        "No new user-facing error text is introduced as part of this fix (keep user-facing text in English if any is added)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/audio/useAudio.ts",
          "operation": "modify",
          "description": "Memoize `playBackgroundMusic` (and any other callable functions returned by `useAudioManager`) so their identity remains stable across renders unless behavior must change."
        },
        {
          "path": "frontend/src/game/GameView.tsx",
          "operation": "modify",
          "description": "Adjust `GameView` effects so function dependencies (e.g., `playBackgroundMusic`) cannot cause repeated initialization; if needed, separate concerns into multiple effects (initialization vs. audio start) and/or use refs to call the latest callbacks without making them effect dependencies."
        }
      ]
    }
  ]
}